[
    {
        "title": "Daily Discussion Thread for February 14, 2025",
        "text": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1ip82ri)",
        "date": 1739530642.0
    },
    {
        "title": "Weekly Earnings Thread 2/17 - 2/21",
        "text": "",
        "date": 1739547445.0
    },
    {
        "title": "Flip it",
        "text": "",
        "date": 1739536721.0
    },
    {
        "title": "Nvidia dissolves stake in Soundhound AI and Serve Robotics",
        "text": "",
        "date": 1739537732.0
    },
    {
        "title": "RDDT WILL TAKE US TO VALHALLA",
        "text": "98% of my portfolio is now invested in RDDT. The other 2% is in Paramount calls with a 2027 expiration. \n\nI originally started buying back around IPO but I purchased 5500 shares last night on the dip (between $183-174) so now my cost basis is over $100 and it make me sad.\n\nRDDT’s IPO was wildly underpriced. Just no stock with such a high chance of holding future MAG7 status should IPO this low. \n\nHow could it hold mag 7 status? \n\nIt’s the brain off the internet. Sam Altman owns 10% of Reddit. You know why? Because he’s known this for a long time. He needed it for ChatGPT. \n\nYou know who else has always needed Reddit? Google. Check out this quote from the intelligencer in 2023 back before Reddit was a public company \n\n“On Monday, thousands of the largest communities on Reddit went private, effectively removing themselves from the site. In an instant, Reddit became less interesting and useful. Remarkably, so did Google: As one of the internet’s biggest searchable repositories of content made by humans, including millions of user-generated questions and helpful answers, Reddit, which was started in 2005 as a link aggregator with the goal of being the “front page of the internet,” has become part of the search engine’s core infrastructure.”\n\nBoys and Girls - that $6.5B IPO was a gift from the Gods.  It’s still a steal $50B market cap. Remind yourself that share price is meaningless. I think the stock has room to run for a very long time before the share price reflects its long term growth potential. \n\nSpez describes RDDT as an online city. I believe, as time marches on, that description will become true in ways that we can’t imagine at the moment. \n\n\n",
        "date": 1739509459.0
    },
    {
        "title": "Pretty much accurate",
        "text": "",
        "date": 1739492096.0
    },
    {
        "title": "INTC DIAMOND HANDS until Nana’s grandson breakseven",
        "text": "I really do believe that we can hit 28 or 30 this month, a little more patience with this position.\n\n\nThey are doing will with Core Ultra 9 and soon will have a joint venture with TSMC. And a possible CEO to take place which would be a positive sentiment for the company. Company is down 60% and i’m still looking for a 30-50% upside this year, \n\nI’m keeping my market position but will reduce market share when it hits 28. Please be the next stock pick of the year! \n\n\nCurrent position \n\n3m Calls March 21-2025\n3.4m Market position ",
        "date": 1739530183.0
    },
    {
        "title": "Google AI Chief says company has ‘all the ingredients’ to beat China’s DeepSeek",
        "text": ">Google’s AI chief told employees that he’s not worried about China’s DeepSeek and said the search giant has superior artificial intelligence technology, according to audio of an all-hands meeting in Paris on Wednesday.\n\n>At the meeting, Alphabet CEO Sundar Pichai read aloud a question about DeepSeek, the Chinese start-up lab that roiled U.S. markets recently, when its app shot to the top of the Apple’s App Store, supplanting ChatGPT. DeepSeek released a research paper last month claiming its AI model was trained at a fraction of the cost of other leading models.\n\n>The question, which was an AI summary of submissions from employees, asked “what lessons and implications” Google can glean from DeepSeek’s success as the company trains future models.\n\n>Google DeepMind CEO Demis Hassabis was called on to provide the answer.\n\n[Full Article](https://stockflow.llc/articles/bfclj3qdoy8ih8fx693v1snu)",
        "date": 1739545300.0
    },
    {
        "title": "Jack Ma is back!",
        "text": "https://finance.yahoo.com/news/china-invites-jack-ma-deepseek-065956463.html\n\n(Bloomberg) -- China has invited prominent entrepreneurs including Alibaba Group Holding Ltd. co-founder Jack Ma to meet the nation’s top leaders...\n\n\nLet's go $BABA! Up 6% in Hong Kong and overnight",
        "date": 1739521886.0
    },
    {
        "title": "Jeff Bezos' Blue Origin to lay off 10% of employees",
        "text": "",
        "date": 1739506540.0
    },
    {
        "title": "10x... $123k -> $1.2M on HIMS",
        "text": "Alright lady and gent degens. I present to you my first ever 10x on a single trade. I'm pretty proud of this bad boy.\n\nHope you all rode this rocket up with me. This was hell of a fucking trade.\n\nhttps://preview.redd.it/4cszqgxbqxie1.png?width=2140&format=png&auto=webp&s=1779f67dab650ea09c5228bd2fe0e7aac436e457\n\nBought 11/06/2024, sold today, 2/13/2025.  \n",
        "date": 1739464980.0
    },
    {
        "title": "Nancy Pelosi NEW $GOOGL Position 🗞️",
        "text": "\nNancy Pelosi’s financial disclosure report shows she purchased 50 call options on Alphabet Inc. (GOOGL) with a $150 strike price, expiring in January 2026. The transaction, valued between $250,001 and $500,000, suggests a bullish stance on Google’s stock price.\n\nPossible Short-Term Impact on GOOGL:\n\t1.\tIncreased Market Attention: Large trades by high-profile figures, especially politicians, often attract retail and institutional investors. This could lead to short-term buying pressure on GOOGL.\n\t2.\tSpeculation on Future Catalysts: Pelosi’s stock trades have historically sparked speculation about potential government policies or insider knowledge. Investors might anticipate upcoming favorable developments for Google (e.g., regulatory decisions, AI advancements).\n\t3.\tMomentum Effect: If traders interpret this move as a signal of confidence in Google’s future performance, the stock price could experience short-term upward momentum.",
        "date": 1739465998.0
    },
    {
        "title": "Nvidia cuts stake in Arm Holdings, invests in China's WeRide",
        "text": "Source is Reuters. \n\nSOUN is down 15% pre market. WeRide up 90%.\n\nIs this the end of SOUN? My calls think so.\n",
        "date": 1739539702.0
    },
    {
        "title": "$$ PLTR Options + Stocks Total Profit 230K",
        "text": "",
        "date": 1739546114.0
    },
    {
        "title": "Yolo to a Million!!",
        "text": "Went all in on SMCI, holding shares long, also have calls worth about 8.5k. This shit needs to hit $167!!!",
        "date": 1739543522.0
    },
    {
        "title": "Almost Made a Comeback After Years Away Then Went and Chased Losses Until I Was Down $30K. I Quit. You Win. Mercy. White Flag. 😞",
        "text": "",
        "date": 1739544625.0
    },
    {
        "title": "SMCI Gians$$",
        "text": "Gians 204% sold\n\nhttps://preview.redd.it/4sh8wkmfj4je1.png?width=759&format=png&auto=webp&s=f1a818370c883f45dfa36adc180716ac6ada8515\n\n",
        "date": 1739547393.0
    },
    {
        "title": "SMCI $$$ gets $22k in 2 days, less than 50% NICE",
        "text": "",
        "date": 1739545565.0
    },
    {
        "title": "389k RDDT PUTS.  It’s not over.",
        "text": "I aint hear no bell, its not over yet.\nStill holding, just the market doing its thing.\n\n\n(no, I didn’t sleep yet)",
        "date": 1739457453.0
    },
    {
        "title": "Retail sales slumped 0.9% in January, down much more than expected",
        "text": "Consumers sharply curtailed their spending in January, indicating a potential weakening in economic growth ahead, according to a Commerce Department report Friday.\n\nRetail sales slipped 0.9% for the month from an upwardly revised 0.7% gain in December, even worse than the Dow Jones estimate for a 0.2% decline. The sales totals are adjusted for seasonality but not inflation for a month, in which prices rose 0.5%.\n\nExcluding autos, prices fell 0.4%, also well off the consensus forecast for a 0.3% increase. A “control” measure that strips out several nonessential categories and figures directly into calculations for gross domestic product fell 0.8% after an upwardly revised increase of 0.8%.\n\nWith consumer spending making up about two-thirds of all economic activity in the U.S., the sales numbers indicate a potential weakening in growth for the first quarter.\n\nReceipts at sporting goods, music and book stores tumbled 4.6% on the month, while online outlets reported a 1.9% decline and motor vehicles and parts spending dropped 2.8%. Gas stations along with food and drinking establishments both reported 0.9% increases.\n\n  \n[Full CNBC Article](https://www.cnbc.com/2025/02/14/retail-sales-slumped-0point9percent-in-january-down-much-more-than-expected-.html)",
        "date": 1739548304.0
    },
    {
        "title": "Follow Nancy to Promised Land",
        "text": "Followed her on Broadcom and killed it…Tempus AI…yep…what are we doing next, Nance?",
        "date": 1739463914.0
    },
    {
        "title": "How is $COIN not pumping after blowout earnings and bullish guidance?",
        "text": "Disclaimer:I have OTM calls expiring on Feb 21st.\n\nEPS $4.68 vs $2.04 est  \nRevenue +138% YOY  \nNet income +300%  \nTransaction revenue +194%  \nSubscription services +71%  \nTrading volume +185%  \nMonthly transacting users +24%\n\nOk I get it thats the past, but their guidance was pretty bullish too.  Help me understand.",
        "date": 1739529170.0
    },
    {
        "title": "I found out about the power of long term investing (weeklies)",
        "text": "Thank you Nike guy!",
        "date": 1739483999.0
    },
    {
        "title": "$ABNB +350%. Thanks for the 3 mortgage payments",
        "text": "",
        "date": 1739543977.0
    },
    {
        "title": "Thanks BROS",
        "text": "Next stop, $100. I had 4,000 shares at one point too. 😖",
        "date": 1739509447.0
    },
    {
        "title": "Robinhood Options finally available in the UK",
        "text": "",
        "date": 1739548290.0
    },
    {
        "title": "20k YOLO NBIS",
        "text": "NVIDIA closing other positions to buy NBIS. \nUSA Stargate 500b investment (old news but money moves slow).\nNVIDA earning sis next week, regardless of how it goes I think NBIS is going to print.\n\nNext week is NBIS earnings.\nI’m balls deep in this, this could make or break me. If I lose Im gone forever. If I win I’ll yolo more :)\n\nSee yall at wendys. Or valhalla. ",
        "date": 1739546530.0
    },
    {
        "title": "BigBear.AI (BBAI) -- Time to Get Off? Or go full regard? Here's my DD.",
        "text": "*\\*Second submission attempt with hopefully appropriate position screenshot\\**\n\nFirst, let me give credit where credit is due and give props to this BBAI rally we're witnessing. Pretty impressive, though speculative.\n\nPlease see my short position below and allow me to explain why I'm bearish on BBAI and why this party may come to an end soon if retail FOMO/hype runs out. I'll try to keep this high level and brief.\n\nhttps://preview.redd.it/e400jt6zi0je1.jpg?width=1170&format=pjpg&auto=webp&s=23ba9b2b06c43c486b81abf2d48febd7491883e3\n\nI wanna get into the catalysts that have started this rally. The typical news people praise includes the new CEO and his relationship with Trump, government contracts and backlog. I'll end by giving my thoughts on the stock.\n\n**1. Kevin McAleenan, recently appointed CEO and former DHS Secretary under Trump**\n\nThere's speculation that with Trump back in the White House, McAleenan's past relationship with the President will be beneficial for BBAI and may help secure future contracts. I believe this is false and would go as far as saying it actually may be a detriment given their history and here's why:\n\n* BBAI CEO Kevin McAleenan only served as DHS Secretary from April 11, 2019 to November 13, 2019 which was essentially a brief 7-month interim tenure. His tenure was not only short but publicized; CNN reported that Trump referred to him as an \"Obama guy\" and their relationship ran hot and cold. Additionally, Trump never officially stated if he would give McAleenan the position permanently. McAleenan resigned before we could see otherwise, becoming one of the shortest-serving secretaries in the department's history. *Source:* [Acting Homeland Security chief McAleenan was prepared to resign in June, felt undermined by subordinates](https://www.cnn.com/2019/08/08/politics/mcaleenan-immigration-hardliners-white-house/index.html)\n* **BBAI CEO Kevin McAleenan on PBS, publicly spoke out about Trump and stated Trump's rhetoric during the attempted insurrection at the State Capitol created a dangerous situation. He went as far as saying that it was an assault on our democracy.** *Source:* [Former head of Homeland Security on the dangers of Trump's rhetoric](https://www.youtube.com/watch?v=8DNoXrWyJiw)\n\nWhile I won't go as far and say they had a contentious relationship, it certainly appears that there may not have been mutual respect. You can do a quick google search to find more detail on this, there are a bunch of publications and articles available online speaking to BBAI CEO's resignation and speaking out about Trump.\n\n**2. Government Contracts/Backlog (Financial Analysis)**\n\n*Historical*\n\nBased on historical 9/30/24 TTM, cash burn for operating activities was $23.4 million with cash reserves of $65.6 million that gives them just 2.8 years runway to operate and that's before debt servicing, taxes or extraordinary costs. **So they essentially only have 3 more years of operations in their current financial condition.**\n\nIn regards to debt, they reported total debt of $196 million which has recently been restructured and extended from a 2026 maturity to a 2029 maturity. While this 3-year extension is a positive note, it cancelled their $25 million working capital revolver and BBAI will likely need to find additional financing to support operations in the near future. **Given their current leveraged debt position, they will likely not be able to find traditional bank financing which leads them to** **trade equity for cash AKA additional issuance of shares or more dilution**.\n\nBBAI has been and will remain upside down for the foreseeable future. They also do not hold any meaningful tangible assets in a liquidation scenario, most of their assets contain intangible assets (software IP) and Goodwill (acquisition).\n\n*Forward-looking*\n\nManagement reports ending backlog at 9/30/24 was $437 million. Unfortunately detail for each contract is not publicly available but we can make some assumptions.\n\n* We know the Army contract is $165 million over 5 years (we'll assume straight-line for simplicity). If we assume the same gross profit margin of \\~26% reported for the 9/30/24 period; the Army contract would provide $8.6 million in annual gross profit or $715 thousand monthly gross income.\n* $272 million would be remaining in backlog and if assuming a 10 year duration this would provide $7.1 million in annual gross profit or $59 thousand monthly gross income. I'm assuming that the FAA contract is the next largest and that was disclosed to have a 10 year duration. I think this is a reasonable assumption.\n* In total we have $15.7 million in annual gross profit for at least the next 5 years. Keep in mind this is also assuming there are no issues/delays with deliverables/work-in-progress or contract draws. My math also assumes that backlog amount is unchanged at the start of 2025 (most likely lower given the work done in Q4 2024).\n* OpEX -- TTM operating expenses were reported at $86.6 million which is a monthly amount of $7.2 million. I think it's also important to keep in mind that OpEx has been increasing period over period and that shouldn't be a surprise given the need for R&D in the AI space and scaling of operations like increased headcount to accommodate additional contracts/work size. Engineers aren't cheap but Glassdoor says differently in BBAI's case, which I'll talk about more below.\n* So keeping all that rough math in mind, we have about **$70.9 million in annual operating losses** or $5.9 million in monthly operating losses projected in this year. **This is before taking into account debt repayment ($196 million), taxes, or any extraordinary costs that may arise (litigation, bad things, etc.). It also assumes they run into no bumps along the way, operationally, which they have already stated is to be expected and comes with the AI territory. AI space is a competitive space and with everything DOGE and the Trump administration is doing, I believe there is not only operational risk but reasonable contract risk.** This share price is obviously not reflecting the fundamentals. People are saying one more contract to the moon when in reality BBAI needs contracts just to get to sea-level.\n* I should note that these figures do not include the recent contracts from the Navy ($5 billion) and DOD/CDAO ($1.3 million). The reason being, I consider the DOD/CDAO contract nominal at $1.3 million. More importantly, we have no idea how the Navy's SeaPort NxG contract is structured for BBAI besides the news that they've been included in the program and the total program's contract amount. There are thousands of vendors/companies who also have access to this $5 billion. For example. BBAI was among 1,023 companies that were awarded rolling admissions (2nd round) and access to the $5 billion Navy program. **Including first and second round, there are over 2,400 companies accepted in the Navy's SeaPort NxG program. Admitted vendors still compete/bid and are awarded contracts within this bubble. This is not guaranteed revenue. It's essentially on an Ad Hoc basis. This is the case with the FAA contract as well.** *Sources:* [Navy Selects Over 1K Vendors for SeaPort NxG Contract Under 2nd Rolling Admissions](https://www.govconwire.com/2025/01/navy-selects-over-1k-vendors-seaport-nxg-contract-2nd-rolling-admissions/) | [Harnessing Power, Navigating Change... TAKE THE HELM FOR PROFESSIONAL SERVICE SOLUTIONS](https://www.navsea.navy.mil/Business-Partnerships/SeaPort-NxG/)\n* Quick and dirty math, the above assumptions would get us -$60.2 million in EBITDA (assuming $10.7 million depreciation addback) which would give us a P/S ratio of -0.24x based on 252 million outstanding shares. This ultimately equates to a P/E ratio of -41.7x if we assume an average share price of $10. All non-sense numbers in a nutshell.\n* Additionally, they will have $12 million in annual interest expense on their $200 million facility and income taxes will increase with increased income which was previously reported at $22 million for 9-month 9/30/24.\n* BBAI's [GlassDoor.com](http://glassdoor.com/) employee reviews reek of the same sentiment. **Summarized as bad work/life balance, paused inflationary raises (losing money working there), lack of direction from management, high turnover, etc.** *Source:* [GlassDoor: BigBear.ai overview](https://www.glassdoor.com/Overview/Working-at-BigBear-ai-EI_IE4857471.11,21.htm)\n\n**Closing Thoughts**\n\nTake my numbers/analysis with a grain of salt.\n\nFrom a business standpoint, it's not all peaches and cream on the horizon for BBAI -- they are churning and burning with a high need to keep product improvement development and contract generation at a high level. Two very difficult and costly things to do in the AI space.\n\nI have concerns over their financial condition, internal processes, and future cash flow as they do not seem to exist.\n\nStock price is insanely high for a business that's never turned a profit. Just because it has a few new contracts? Its got the new debt to match too, don't forget.\n\nNot to mention the reputation to boom and bust around this time of year.\n\nI do not know the timing but I think they will likely issue more shares to take advantage of this price action. This thing ain't just going to keep going up and they need all the capital they can get.\n\nFuture contracts are not guaranteed, management knows this so they will be constantly exploring ways to secure additional liquidity/working capital...most obvious place for that is share issuance AKA lower share pricing.\n\nI'll end with this, it's going to be interesting to see how this plays out, especially with the long weekend and earnings being around the corner. I feel like there's still a lot of hype and FOMO but this ain't Palantir 2.0.\n\nWish ya'll the best, hope everyone does well.\n\nI welcome discussion on convincing me to go long.\n\nThis is not financial advice.",
        "date": 1739499243.0
    },
    {
        "title": "ROKU - finally in plus after over three and a half years",
        "text": "Diamond hands after averaging down",
        "date": 1739544237.0
    },
    {
        "title": "I sold puts to the 389k RDDT PUT YOLO guy u/ISKslav",
        "text": "",
        "date": 1739456690.0
    },
    {
        "title": "How F*cked am I?",
        "text": "This can’t keep going up forever no?\n",
        "date": 1739489457.0
    },
    {
        "title": "When you sell two days early and miss out on 40k profit",
        "text": "Scared money don’t make money😪😭",
        "date": 1739483269.0
    },
    {
        "title": "Finishing my week",
        "text": "",
        "date": 1739546124.0
    },
    {
        "title": "Starbucks to open 500 stores in Middle East in next 5 years",
        "text": "This make it a good time to grab calls? I have some SBUX but not much..\n\n\nhttps://finance.yahoo.com/news/starbucks-open-500-stores-middle-053510335.html\n\n",
        "date": 1739513926.0
    },
    {
        "title": "SMCI Bull Thesis",
        "text": "SMCI BULLISH Thesis\n\nThis has been the most time I've ever spent researching a stock. So far, in matters of relevance, key indicators have been used based on relevant facts over BS fiction short seller reports. Let's look at historical facts and readily available information. SMCI company is BRUTALLY HONEST, and they are being reported as misleading. I will have every short summaries of all relevant information of last delisting, and recent late filing to instill confidence of actually reporting this time.  Adding more calls at open. For Mar 21. paper handed a ton already. over 5 k in profits. Been following since $18.already but the more I dig the more confidence I get. Will allocate more of those funds in intervals before Feb 20 as I believe that day will have huge news. Will probably not add any very long dates calls because I believe market cap will increase 100% by Mar21. Probably 300-500% by 27. But those profits for Mar21-April range are going to absolutely generate 1000s% anyways. \n \nThis post indicates all relevant information and overlooks no available Info im confident. if I did post a comment as I’ve got over 100 hours jn on this stock now. \n\nKeep in mind CEOs for SMCI and Nvidia are meeting DDN Feb 20 to discuss what DDN says as possibly ground breaking AI news. Black Stone just invested 300m into this Private equity company. I think we can use some of the words SMCI said in the last business update to make this information relevant like “Confidential new product line” he touched on this Feb 12. Let’s keep in mind SMCI offered 700M convertible notes. Not sure what’s about to roll out but I think SMCI was pummeled with legal fees and this news needs money like now. I’m almost certain we have filing before the Feb 25th. I say this 1) DDN Feb 20 2)Before 20th or after but before 25th release all filings1, 10ks, 3, 10Qs. 3) New CFO before 25. 4) NVIDIA discussing huge earnings with new news on huge upcoming projects. Maybe talking and pumping SMCI with proud partner getting ready for this huge BOOM. \n Couple this with Trump, EU already talking HUNDREDS of billions will be dumped into AI over next 5 years. Couple this with trump possibly doing big tax cuts, like we’ve seen in the past. And honestly couple this with the true news that this company is literally pulling in 10s of billions as they were in 2023 and are at half the market cap on all this BS news. I think SMCI priced in for SMCI not listing documents and going under selling OTC I’m being serious. 25b rev this year market cap 24b. This is going to change very soon. \n\nInformation below this will give you more confidence that SMCI will 100% file based on being honest in the past. And some other miscellaneous things. \n\n1) September 14, 2017. The initial delay in 10-k. \\*EXACT WORDS\\* \"The Company is unable at this time to provide a date as to when the review and the audits will be completed.\" this is over internal controls over financial reporting for June 30, 2017, 10-k... \"Company operating expense expected to be higher for the quarter because of legal and accounting costs.\"\n\n2) January 30, 2018. Fin info/Management changes/delayed sec filings update... \"Audit Committee completed disclosed investigation. We will need additional reviews before the finalized 10k report to determine if changes will need to be made. KEY UNABLE THIS TIME TO PROVIDE DATE FOR 10-K.\"  Today's new CFO is Kevin Bauer. Needs plan update on FEB 28 for filings due March 13 \"SEC Compliance.\"\n\n3) FEB 20, 2018. The exact words 8 days before the deadline... I need more time for 10k and will request an extension on an update for FEB 28. If not granted, they said they had the option to appeal. (Was Granted) extended 180 days  \n\n4) May 3, 2018, Fin/Info Because I'm transparent, I include all \"KEY POINT relevant updates to show endpoint differences in tones.\" Back to update, \"Audit committee overseeing additional testing company believes it is nearing completion for \\*current filings only\\*. \\*NOT INCLUDING 10K BACK TO BEARISH\\*.\" Then it directly goes back to saying additional testing is required to analyze the impact on the company's historical financial statements and complete 10k... Back to square 1. They say they will file 10Q for sep30,dec31, and March 31 after the 10k release, but there is no update, and they say additional time is needed for 10k. He still needs 10- K by August 24.\n\n5) July30/Aug 7 4Q fin. Results were scheduled for August 7 after the announcement on July 30 and rescheduled to August 21, on August 7. It's horrible News, as the update was critical at this point because delisting would occur if reports were not filed on August 24... This is where I believe all the people claiming SMCI are crooks. \\*But keep in mind at no point did they warrant 10-K was anywhere near ready but consistently diligent with saying current reports are looking good \"10Qs\", but 10 K still needs extensive care and has to be released first, then goes on and says 10K still needs to go through extensive testing for historical info throughout 2017-2018 going all the way to final update\\* Yes this information for investors would warrant an even further upset failing to produce positive News for compliance. But again, at NO POINT DID SMCI EVER POST NEWS OF 10 K progress nearing completion up until or by AUG24.\n\n6) August 21 4Q Fin/Info is irrelevant; it is a separate article. SEC FILINGS... It says, as we all know, extreme leaps were made, but they came up short due to the pure magnitude of historical information that needs to be audited. Remember that the AI wave is pumping in tons of new business, and companies need extensive capital for pure growth to come. And also being blasted by legal fees and accounting costs crippling this company's margins and ability to keep up with demand. But at NO POINT EVER INSIGHTED SIGNIFICANT VALUE IN THE PROOF OF RELEASE OF 10K.\n\nPart 2. (1B) 2024/5 current news. (1B1) News compares/contrasts the 2018 delist to the 25 News and relists 2020. (1C) Deception of short sellers HIDENBUGER (closed)actual truths and findings of (EY).\n\n1B) August 28 Delays 10K internal controls over Fin. Reporting.\n\n2B) November 5: A special committee releases information/SEC filing update \\* investigation is complete on concerns raised by EY. No fraud or misconduct was found.\\* \\*But for remedial measures, strengthen internal governance and oversight functions\\* says unable to give a time frame on 10k filings\\* No auditor is the reason for that\n\n3B) November 18 new auditor BDO. Ask for a time extension. \\*November 20 says they will have all updated audited 10ks and 10qs within the discretionary period\\* if it is granted time. This, along with the request for late filings of current quarters, is 10 qs.\n\n4(B) DDecember 2review independent committee. It talks about recommendations for a new CFO, executives, and strengthening measures with more experience. As well what was supposed to be assessed raised by EY. concerns \"(i) the integrity of the Company's senior management and Audit Committee, (ii) the commitment of the Company's senior management and Audit Committee to ensuring that the Company's financial statements are materially accurate, (iii) the Audit Committee's independence and ability to provide proper oversight over matters relating to financial reporting, and (iv) the tone at the top of the Company about rehiring certain former employees and financial reporting\" All concerns raised by EY appeared to hold no weight, and SMCI was compliant with independent committee everything came back good... Very import read SMCI IR December 2 2024 recommend reading full document. Also, SMCI says they believe they will have all filings within the discretionary period. February 25\n\n5B) February 11, 2024 Fin. Update business call. They said they believe they will file all past and current, up-to-date quarterly and yearly forms. By February 25. They can't say anything more than this, but it's a dead giveaway compared to the reports in the past. Also, I subpoenaed the court for a short seller report from Aug(Hidenburg) And all the suits caused by this. SMCI says these are without merit and that no past statements need restatements. \n\n(1B1) January 9 2020 approved relist 14th first trade day.\n\n(2B1) AUG 25, 2020 accounting investigation settlement. They never actually admitted to anything of fraud but indeed paid the settlement. Whether they cooked the books or not, they likely did. Do I find this necessarily bearish? For the time being, yes (2020). \n\n(3B1) Compared, some factors had near resemblances. Based on reports raised by Hidenburg, EY.\n\n(4B1) In Contrast, there was a reasonable likelihood that 2024 issues were raised for external Speculation. In 2017/18, there was a valid reason to believe that SMCI was cooking books.\n\n1C) Hindenburg reports, I'll be 1000% honest: this is the laziest report I've ever seen written. I'll go straight down the list. The statement is fear-mongering availability bias practice; Hurryand reminds them of 2018. Anyways,. It says SMCI was listed in 2018. Get this. I quote, \"By August 2020, found improperly reporting revenue and fined.\" It would've taken half a second to realize this was, for instance, for 2018 delisting. I will tell you that Smci execs after relisting. I will say this with this statement about hiring three execs back 3 months after reinstatement to scare people that they're doing the same thing. No evidence for years after has ever been brought up about the. SEC heavily looked into SMCI after initially relisting. This is absolute madness. Well, I don't need to tell you this is false because there are about five statements down. The new CFO, extremely honest, goes even further in-depth several pages down. Later in the article,. It goes on and on about how great Kevin Bauer would never steal. Then, he says that SMCI cut his head in 2021 so they could get going. He talks about how the SEC liked him and how SMCI feared him being too fair and honest. But as mentioned, they were already improperly recording revenue 3 months after reinstatement. Then he seems to go on about them doing business with his brothers, about an industry I know well. It looks like this brother's company does sub-assembly, a massive manufacturing tool. I'm sure it's way cheaper labor overseas. Then, it acts as if SMCI is wrong for not disclosing them when they didn't have to until the filing. EY was also going through losing 84 companies because they were labeled the company with the most mistakes made by mad numbers. It costs 200 million dollars with all of these losses for EY. This was a perfect chance for EY to take the steam off their prior failures. Anyways, all the information claimed on SMCI has now been claimed as false. Not only this, but EY did all the 10-Q for 2023. Why did they wait until mid-Octoberr after Hindenburg reported a year after they did the auditing on every 10-Q prior to report all of SMCI fraud?\n\n",
        "date": 1739541005.0
    },
    {
        "title": "UPDATE ON 500k TSLA SOLD",
        "text": "",
        "date": 1739545120.0
    },
    {
        "title": "Finally profitable on ROKU 5 years later",
        "text": "",
        "date": 1739545793.0
    },
    {
        "title": "What Are Your Moves Tomorrow, February 14, 2025",
        "text": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1iotd9e)",
        "date": 1739480252.0
    },
    {
        "title": "Accidentally timed the top on SERV",
        "text": "got rid of it yesterday because I didn’t like the volatility 😅",
        "date": 1739548239.0
    },
    {
        "title": "Sold HIMS for CELH",
        "text": "Sold hims last week at $34.5 for a 25% gain, thought I was a genius and decided to put into CELH at $25. Now I’m down big on CELH and hims is up to $60.\n\nHow do I cope with this???\n\n",
        "date": 1739500652.0
    },
    {
        "title": "Rivian Automotive (RIVN) Expected to Beat Earnings Estimates: What to Know Ahead of Q4 Release",
        "text": "",
        "date": 1739516939.0
    },
    {
        "title": "INTC gain 270% $$20K🚀🚀",
        "text": "",
        "date": 1739457926.0
    },
    {
        "title": "SMCI MILLIONAIRE!",
        "text": "I shit my pants when they went fullscale production Nvidia Blackwell rack solution. told myself i’m gonna see 40 again, Till next time again SMCI! Thank you for saving my AMD position atleast i’m not down overall now cuz of Auntie Lisa\n\n",
        "date": 1739463851.0
    },
    {
        "title": "Sold after Applovin earning call yesterday",
        "text": "",
        "date": 1739471371.0
    },
    {
        "title": "APP 450P quick in and out 500% gain",
        "text": "Got mad when I saw it was up 38%, so gave a shot on puts side and decided to denote 4K to market makers if it doesn't work. ",
        "date": 1739488655.0
    },
    {
        "title": "Is Netflix just built on magic and cocaine WTH",
        "text": "",
        "date": 1739480562.0
    },
    {
        "title": "Robinhood Roth IRA yolo",
        "text": "Tax free gainzzzz baby",
        "date": 1739493993.0
    },
    {
        "title": "1k nuggies into 9k nuggies",
        "text": "",
        "date": 1739479377.0
    },
    {
        "title": "Been a good week so far",
        "text": "",
        "date": 1739521350.0
    },
    {
        "title": "252 0dte SPY YOLO 💎👐",
        "text": "Bought 252 $608 and $609 strike calls around noon today. Most degenerate trade of my life. Valhalla.",
        "date": 1739480987.0
    },
    {
        "title": "2 Commas thanks to PLTR 🚀",
        "text": "Bought and held since 2021, never gave up and mostly stopped worrying about it. I didn’t include my IRA but that puts me at $1.2M at 29. Going to keep going, but will sell half at least if it goes to $100 and continue holding another 5-10 years. ",
        "date": 1739459857.0
    },
    {
        "title": "HIMS - What a ride",
        "text": "",
        "date": 1739480693.0
    },
    {
        "title": "I belong here",
        "text": "Bought at the top and sold at the bottom 🙉🙈",
        "date": 1739520717.0
    },
    {
        "title": "Sign up for my course $1000 a month. DM me",
        "text": "",
        "date": 1739549623.0
    },
    {
        "title": "Nvidia’s Q4 2023 13-F Filing: Portfolio Adjustments",
        "text": "[https://www.sec.gov/Archives/edgar/data/1045810/000104581024000021/0001045810-24-000021-index.htm?utm\\_source=chatgpt.com](https://www.sec.gov/Archives/edgar/data/1045810/000104581024000021/0001045810-24-000021-index.htm?utm_source=chatgpt.com)\n\nNvidia (NVDA) just released its latest **13-F filing**, revealing it's shifts in its investment portfolio. Every quarter, institutional investors with over $100 million in assets have to disclose their holdings, and these updates often hint at where big money sees opportunity. Nvidia made some notable changes this time.\n\n**Exited Positions:**\n\nNvidia has completely divested from the following companies:\n\n* **SoundHound AI (SOUN):** Specializes in developing voice AI technology for applications in smart devices, call centers, and automotive systems.\n* **Serve Robotics (SERV):** Focuses on creating autonomous delivery robots designed for sidewalk transportation, aiming to revolutionize last-mile delivery.\n* **Nano-X Imaging:** Utilizes AI to enhance the accessibility and affordability of medical imaging, particularly X-rays and other diagnostic tools.\n\n**Reduced Stake:**\n\nIn addition to these exits, Nvidia has reduced its stake in:\n\n* **Arm Holdings (ARM):** Despite Arm's central role in the AI chip industry, Nvidia decreased its holdings by 44%, indicating a strategic reallocation of resources.\n\n**Retained Holdings:**\n\nNvidia maintained its entire positions in the following companies:\n\n* **WeRide Inc.:** A Chinese startup specializing in autonomous driving technology, contributing to advancements in self-driving vehicles.\n* **Nebius Group N.V.:** An AI cloud infrastructure provider, offering scalable solutions for AI applications across various industries.\n* **Recursion Pharmaceuticals (RXRX):** An AI-driven Drug Discovery biotech company focused on accelerating drug discovery and development through machine learning and automation.",
        "date": 1739549361.0
    },
    {
        "title": "MSFT",
        "text": "Not sold yet because I m just dumb fuck who hates money ",
        "date": 1739480676.0
    },
    {
        "title": "Bros Gain 1.5k -> 12k",
        "text": "Dutch Bros > ",
        "date": 1739470692.0
    },
    {
        "title": "$120K YOLO on Coinbase (shares only)",
        "text": "",
        "date": 1739477563.0
    },
    {
        "title": "$NVDA Make Me Less Poor",
        "text": "Nvidia pretty kool- that's my DD. 2025 also pretty kool in 2nd photo. Now I'm less poor. But still poor. So I am regard waiting to lose all my monies🫡",
        "date": 1739482086.0
    },
    {
        "title": "RDDT’s drop in DAU’s is highly concerning (time to sit out Q1?)",
        "text": "Position: 298 shares\n\nI’m the guy that wrote [RDDT = AI Crack](https://www.reddit.com/r/wallstreetbets/comments/1g6flb6/reddits_data_ai_crack_why_im_betting_big_on_rddt/) back when Reddit was still $68. It’s done pretty well since then.\n\nHeld all the way through to yesterday’s earnings expecting something special but feel pretty disappointed.\n\nI know a lot of people here are invested in RDDT and I’ll probably pick up some hate. But I think it’s important to try and look at this objectively (not financial advice).\n\nThere’s one thing I can’t seem to get my head around -\n\nBy now everyone's seen the graph of Reddit’s visibility in Google over time.\n\nWell this is that same data, but with Reddit’s visibility in Google plotted against their DAU’s:\n\nhttps://preview.redd.it/plghusdqbzie1.png?width=1390&format=png&auto=webp&s=217281134fb690c14b3638796e51196e84f5947f\n\nHopefully you’d agree there’s a pretty clear correlation there. Before the boost from Google the last few years, the historical trend for DAU's was flat.\n\nTo me something smells off with the latest earnings numbers: \n\n1. Visibility tools report their search traffic at its highest level EVER, but DAU’s grew at the slowest rate since 2023 Q1/2.\n\n2. In the US (by far the most important market with the highest revenue per user) DAU’s actually *dropped* slightly this quarter compared with Q3.\n\n3. On the earnings call, Reddit blamed a drop in Google visibility. But all of the tracking tools (which do have a small lag but update daily) show a drop and recovery beginning in January (after Q4). This shouldn’t have affected Q4 numbers and feels like an excuse for something else.\n\n[SEMRUSH](https://preview.redd.it/gugkmb2ybzie1.png?width=1408&format=png&auto=webp&s=2f7451949f6ecafb3271e84b6744dd7ca6243413)\n\n[SISTRIX](https://preview.redd.it/vsx12eg0czie1.png?width=1510&format=png&auto=webp&s=cdefe2e2ebe858e5bc7cfd6d9fddc7cc6870c7c5)\n\n4. Even if the fall in DAU’s was a result of Google traffic dropping (let’s say the tools were just delayed) visibility barely dropped before recovering straight away. So for a relatively minor, temporary drop in visibility to have this much impact on DAU’s is pretty concerning (even knowing how reliant they are on Google). \n\n5. We know Google’s algorithms change on a whim and can’t be relied on. But if all that traffic (the third most of any website on the internet) isn’t leading to an increase in DAU’s, where is all the growth that’s priced in going to come from?\n\nA few possible theories I’ve been weighing up in my head:\n\n1. Political content on Reddit and the prevailing left-wing consensus is alienating one-half of the population in the US.\n\n2. The drop in Google visibility did cause a drop in DAU’s in January, but they’ve pulled the numbers forward to soften the blow in Q1 2025. (Are they allowed to do this? I have no idea)\n\n3. Something else is turning people away from the platform in the US (or away from social platforms entirely?).\n\nI could be wrong and this is probably just a blip, but I’m pretty shocked that a platform can attract at least **1bn** free monthly visits from Google in the US and still see a drop in their daily active users.\n\nMy big worry would be that Reddit has hit its ceiling in the US – which is far and away the most important country for revenue growth. Or that those extra Google visitors are no longer converting into extra users.\n\nDon’t get me wrong there were some big positives in earnings and especially the increase in US ARPU. There’s still a lot of room for growth in ARPU and I do still think Reddit in general is a good long-term buy. \n\nBut for the first time since investing I feel spooked and looking at sitting this quarter out.\n\nThoughts?",
        "date": 1739485186.0
    },
    {
        "title": "My first yolo! 389k RDDIT PUTS FEB14",
        "text": "I never had this much amount of money before. Been a good month. This is literally my whole networth.\n\nWinning recipe, don’t quit when your winning. EYE OF THE TIGER MODE.\n\nThis stock is propped up by delusion and hopium, and I’m about to be the intervention.\nFULL SEND!",
        "date": 1739385988.0
    },
    {
        "title": "ASML Gain$",
        "text": "One short term trade, sold on expiration date\n\nhttps://preview.redd.it/qies991qoyie1.png?width=760&format=png&auto=webp&s=b44f93d03047e7fe15e10282eb7ea8b7fa0063aa\n\n",
        "date": 1739476535.0
    },
    {
        "title": "$GRRR gains",
        "text": "Finally hit the $500mm market cap. Sold half to take some off the table.\n\nCurrent positions: 715 shares across multiple accounts",
        "date": 1739482108.0
    },
    {
        "title": "PLTR LOSS 🙌",
        "text": "T",
        "date": 1739461616.0
    },
    {
        "title": "$HIMS Gains",
        "text": "Nice gain on $HIMS. Is it headed for $100?",
        "date": 1739476264.0
    },
    {
        "title": "I like Fruit BB",
        "text": "I entered late in this run but im here",
        "date": 1739486984.0
    },
    {
        "title": "500k on $TSLA calls wish me luck",
        "text": "",
        "date": 1739389449.0
    },
    {
        "title": "Just sold Palantir after almost 4 years",
        "text": "As soon as I sold it went back up a bit lol but the valuation right now is just way too high. I expect a correction and I plan to reinvest in it. I'm hoping on going all in on TSLA next as it's oversold. Any insight? ",
        "date": 1739375230.0
    },
    {
        "title": "Herbalife ($HLF) is going to bounce back HARD after EARNINGS",
        "text": "What's up snitches, I bet Herbalife ($HLF) is not the name you were expecting to see today when you opened up WSB.\n\n**MISSION BRIEF**\n\nFor those of you that don't know Herbalife, it's a MLM pyramid scheme company that makes their affiliates sell Wendy's dumpster tier quality protein shakes to neighborhood moms. To makes things worse, the company is down \\~90% from their ATH of \\~$60 in 2021 to a mere \\~$5.78 today based on quarter after quarter of growth decline. Luckily I can still post this DD on WSB as its just over the $500MM market cap requirement.\n\nhttps://preview.redd.it/p2nojs4vg4je1.png?width=925&format=png&auto=webp&s=d68cb393c7c63aac3915056c36f0beeb2922e998\n\nAnd we're going to go LONG. Yes, LONG just like my pe...riodic losses in the market.\n\nIf you need some motivation for this trade or want to explore this HLF multiverse, go watch the 'Betting on Zero' documentary where you can see Bill Ackman and Carl Icahn battle it out over this stock. For the regarded ones among us, we will be roleplaying Carl Icahn for this one.\n\nhttps://preview.redd.it/3wa3q7boi4je1.png?width=1163&format=png&auto=webp&s=16dd4ed18b97ef9812117c6ee749699eae98a496\n\nNow I hear you asking, why are we going long? This company looks like it's speed running bankruptcy and setting a WR while doing it. The answer is simple, ~~I have no idea what I am doing~~, big money and insiders are betting on it's survival and a rebound in the stock price.\n\n**EARNINGS**\n\nEarnings is coming up for HLF on Feb 19 2025. That is Wednesday after market close folks.  \nNow lets look at the last few quarters of earnings:\n\n* **Quarter Ending: Sep 30, 2024**\n   * Expected EPS: $0.30\n   * Actual EPS: $0.57\n   * 1-Week Post-Earnings Stock Price Change: +24.2%\n* **Quarter Ending: Jun 30, 2024**\n   * Expected EPS: $0.39\n   * Actual EPS: $0.54\n   * 1-Week Post-Earnings Stock Price Change: -25.7%\n* **Quarter Ending: Mar 31, 2024**\n   * Expected EPS: $0.37\n   * Actual EPS: $0.49\n   * 1-Week Post-Earnings Stock Price Change: +15.9%\n* **Quarter Ending: Dec 31, 2023**\n   * Expected EPS: $0.39\n   * Actual EPS: $0.28\n   * 1-Week Post-Earnings Stock Price Change: -28.6%\n\nDo you see the pattern? DO YOU SEE IT? Every earnings this mother father moves a lot. It moves 25% in a week like its nothing, filthy.\n\n# Q2 2024 (April - June) – “One last dump”\n\n* **Net Sales:** $1.3B (down 2.5% YOY)\n* **Adjusted Net Income:** $54.8M\n* **Gross Margin:** 77.9%\n* **Office Sale:** Torrance HQ sold for $41M and leased back for 16 months\n* **Debt Refinancing:** $1.6B completed earlier in the year\n* **Restructuring Program:** $80M in annual savings expected in 2025\n\n# Q3 2024 (July - September) – “Debt Paid, Bags Made”\n\n* **Net Sales:** $1.2B (down 3.2% YOY)\n* **Adjusted Net Income:** $58M\n* **Adjusted EBITDA:** $166.5M\n* **Debt Reduction:** Paid down $85M of debt\n* **Forward Guidance:** Raised full-year guidance\n\nBasically, they know they're struggling and they're doing everything they can to reduce debt and reverse this trend. Q3 was the last positive quarter with a spike. The spike didn't last long at all and it sold off harshly after the first month (-40% to date) but we are aiming for that 25% spike again friends.\n\n**INSIDER ACTIVITY**\n\nSo what are the insiders doing besides failing to run their ~~scam~~ company well? Well in 2024, the insiders we're mostly buying more shares from the $7 - $10.5 range. The number of buys was also significantly higher compared to other negative growth years. Granted its mostly one insider buying over the last year but the takeaway is, if they loved the stock at $8, they should REALLY love it in the $5.\n\n**BIG MONEY**\n\nGo to the options chain. LEAPS. **Jan 15'27 12.5C**.  \nDo you see that open interest? Do you see that 10k contracts purchased at $90 a pop. Well my friends, that is a recently opened position and it was opened quite SWIFTLY. When the stock dumped last week from $6.50 to $5.30, this position was opened up quickly. This means these will print GAURANTEED.\n\nThere are also a lot of other option activity on the chain implying a big move one way or another. This one will be volatile on / after earnings day. Almost no chance it stays flat.\n\nIf you're not convinced at this point, then I'm afraid you leave me no choice but to talk about the....\n\n**ANAL-YSTS**\n\nThere are a few analysts that cover this stock. Here are their recent ratings:\n\nhttps://preview.redd.it/xjxij10rh4je1.png?width=1580&format=png&auto=webp&s=e379209b2a3e362c348328106f7fc0746643ef9a\n\nThey are still dishing out $7-$13 targets over the last half year. And I think they couldn't be more right. If this earnings is big GREEN like I predict, then the analysts will pile on with revised ratings sending it even higher.\n\nI even emailed all the analysts covering this stock and while they did all ignore me, I got a vacation auto-response from one of them which is a BIG BULL SIGNAL. Probably on a cruise ship somewhere waiting for the big 50% gain day to drop.\n\n**MORALITY CHECK**\n\nNow it has to be said, I don't really care for MLM scam companies like Herbalife and ultimate would be happy to see them go bankrupt. But money is money, and by longing, I am playing both sides so that I always come out on top.\n\nI literally can't lose!\n\n**POSITIONS**\n\nOpened freshly right before posting this DD:\n\nhttps://preview.redd.it/y9h8yr24i4je1.png?width=332&format=png&auto=webp&s=941fd2731c9d41c9bd7a44911d99342f65bc31f5\n\n**QUESTIONS**\n\nPlease leave any questions in the comment section below and someone from our customer service team will respond to your inquiry within 4-12 business days.\n\nThank you for coming to my TED talk.",
        "date": 1739547457.0
    },
    {
        "title": "NVDA YOLO UP DATE 10k—>27k (NVDA CALLS)",
        "text": "YOU PAPER HANDS SOLD ON THAT CPI DUMP?! HAHAHA DIAMOND HANDS. THIS WILL FILL GAP. BUY YOU REGARDS",
        "date": 1739461517.0
    },
    {
        "title": "AMD Corporate Insider buys 500k of stock today 02/12",
        "text": "This is a big purchase - [https://www.sec.gov/Archives/edgar/data/2488/000000248825000014/xslF345X03/wk-form4\\_1739396726.xml](https://www.sec.gov/Archives/edgar/data/2488/000000248825000014/xslF345X03/wk-form4_1739396726.xml)\n\nHere's the link to the form above. Looks like it's the EVP and Chief Commercial Officer, submitted form only about 3 hours ago.\n\n**This P purchase code mean they bought it on the open market, for a cost average of 107.56.** In the recent macro economic landscape, especially with the importance of semis, this is really interesting. I haven't seen this hitting the yahoo news pipeline at all yet.\n\nOnly other insider purchases are back in the 2005/2008/2012 range, all around a 20 dollar cost basis.\n\nEDIT: HE INCREASED HIS HOLDINGS BY 16% - This is a non negligible amount. *It is not about the ratio of stock bought to stock market cap, it is about how much this amount of money means to this insider.* ",
        "date": 1739406868.0
    },
    {
        "title": "Biggest Day for My Portfolio OAT +55%, 17,000",
        "text": "",
        "date": 1739485030.0
    },
    {
        "title": "World's 1st hybrid quantum supercomputer goes online in Japan",
        "text": "Up 13% yesterday \nQBTS beeches…\nD Wave deez smooth nutz into a pile of money like Scrooge McDuck.",
        "date": 1739423515.0
    },
    {
        "title": "Daily Discussion Thread for February 13, 2025",
        "text": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1iogkcj)",
        "date": 1739444251.0
    },
    {
        "title": "Micron has made me so much money",
        "text": "Bought two days ago and it hit my PT already. There’s room to run but I’m happy to take this profit into the long weekend. ",
        "date": 1739544467.0
    },
    {
        "title": "TSMC to the rescue? INTEL chip manufacturing unit to be spun off into joint venture",
        "text": "",
        "date": 1739448279.0
    },
    {
        "title": "Why CRZBY is my \"crazy baby\"!",
        "text": "Good day fellow crazy babies,\n\ntoday I want to talk about one of the biggest German banks Commerzbank (CRZBY) and why I am heavily invested in them.\n\n\n\nHonestly I won't bore you with the basics, but to summarize they have very good financials, with rising common business activity, profit, EPS, dividends and capital:\n\n||2024|2023|2022|2021|\n|:-|:-|:-|:-|:-|\n||\n|sales volume|11,9 B|22,5 B|14,6 B|12,2 B|\n|profit|2,7 B|2 B|1,2 B|431 M|\n|EPS (after tax)|2,28|1,63|0,99|0,23|\n|dividends|0,65|0,35|0,2|0,00|\n|capital|(no data)|527,8 B|491,9 B|473 B|\n\nYes, they do have debt, but it's a bank, that's their business model...\n\n\n\nTo the main topic, why is CRZBY going crazy and will continue doing so?\n\nThere are currently ongoing talks about a take-over from the Italian Unicredit bank. They are threatening a hostile take-over and already hold around 28% of shares, trying to increase their stakeholder power.\n\nMeanwhile Commerzbank is trying to avoid a hostile take-over, but they are apparently not against a merger. We don't know the exact state of negotiations but looks like Unicredit will soon give a formal offer.\n\nOf course to sell at the best price possible Commerzbank also has an interest in pushing the share price up, making them as expensive as possible to buy out. Hence insider buying is also going through the roof, indicading that Commerzbank is trying to \"defend\" by buying shares aswell.\n\nAs a result the share price has been going up and up and up and it will only go further up from here on.\n\nThe bank itself is already undervalued and if Unicredit succeeds with the take-over they will do so at atleast twice the shareprice giving the Commerzbank executives and other shareholders a real nice payout.\n\n\n\nOne thing to mention is the involvment of the German government: The German state is also a major shareholder and as a major German company they are not too happy about such a take-over, especially if it's going to be a hostile one.\n\nBut Unicredit chose a very wise time to attempt this. There is currently a re-election in Germany and the ruling parties have no time to worry about this situation, since they have to put all their resources into the election and their election campaigns.\n\nAnd if there is a new government in 2 weeks (most likely), they'll first have other stuff to sort out.\n\n\n\nAs a result it is highly unlikely, that the government will put a stop to this take-over.\n\n\n\nThat's it for today, happy to hear all your opinions.\n\n\n\nMy positions:\n\nhttps://preview.redd.it/98t2qau964je1.jpg?width=1007&format=pjpg&auto=webp&s=3c48b47e9381bd4f1a0dfac464fa2cb43f2bcac6\n\nadditionally I now own another 1000 shares at 16,19€ from an inheritance account I do not have access to yet, until the paperwork of my deceased great-aunt is all sorted out.\n\n",
        "date": 1739543191.0
    },
    {
        "title": "Reddit just reported fourth-quarter earnings",
        "text": "Earnings per share: 36 cents vs. 25 cents expected\n\nRevenue: $428 million vs. $405 million expected\n\nReddit's sales jumped 71% in the quarter from $250 million a year earlier, the fastest rate of growth for any quarter since 2022.\n\nThe company said first-quarter sales will be between $360 million to $370 million, ahead of the average analyst estimate of $358 million.\n\nNet income almost quadrupled to $71 million or 36 cents a share, from $18.5 million, or breakeven on a per-share basis, a year earlier. Reddit reported adjusted earnings of $154 million in the fourth quarter, topping analysts' expectations of $128 million.\n\nWhile the company beat estimates on earnings and revenue and issued better-than-expected guidance, its user number fell short of expectations.",
        "date": 1739394884.0
    },
    {
        "title": "Coinbase - 22k calls",
        "text": "",
        "date": 1739484763.0
    },
    {
        "title": "Am I cooked?",
        "text": "Yolo half my account looking for that $TSLA gold cuz I'm f'ing regarded. Enjoy my loss porn cuz i got zero chance of recovery",
        "date": 1739398640.0
    },
    {
        "title": "$APP +300%. Thanks for the mortgage payment",
        "text": "",
        "date": 1739471822.0
    },
    {
        "title": "Nbis- can use other chips?",
        "text": "As we are aware, NBiS has a partnership with NVIDIA.\nRecently, I come across news that arm will also become a chip manufacturer possibly having a collision with NVIDIA.  The question j have is does anyone know whether NBIS can also use other chips besides that of NVIDIA....sorry if this question has been posed before.\nThanks!",
        "date": 1739517567.0
    },
    {
        "title": "Never bet against Americans and their love for sugar",
        "text": "",
        "date": 1739460276.0
    },
    {
        "title": "ASTS $$Gain $36K Use these profits to invest in the next option......",
        "text": "https://preview.redd.it/btp7gny78xie1.png?width=1124&format=png&auto=webp&s=899ae259322ffb270c7f6de1d5ce65cbe7ca936a\n\nhttps://preview.redd.it/bu2ro6698xie1.png?width=1124&format=png&auto=webp&s=6c68c3f9e901238f79dfd48cfc2909453919b377\n\n",
        "date": 1739458868.0
    },
    {
        "title": "Rolling the dice #YOLO",
        "text": "",
        "date": 1739505159.0
    },
    {
        "title": "Will my calls recover?",
        "text": "",
        "date": 1739485775.0
    },
    {
        "title": "$HOOD GAINS 🚀🚀🚀",
        "text": "Should I have hold it much longer?",
        "date": 1739458282.0
    },
    {
        "title": "bought the rddt dip",
        "text": "",
        "date": 1739460211.0
    },
    {
        "title": "Just sold Palantir after 4 years because the other guy sold Palantir after 4 years",
        "text": "https://preview.redd.it/f32sbca4nqie1.png?width=1421&format=png&auto=webp&s=ed5ef9b488ea8db65828e645c70de86131b640dd\n\nbought on TD ameritrade which is now schwab which i dont know how to use\n\n  \nthe other guy [https://www.reddit.com/r/wallstreetbets/comments/1intvwg/just\\_sold\\_palantir\\_after\\_almost\\_4\\_years/](https://www.reddit.com/r/wallstreetbets/comments/1intvwg/just_sold_palantir_after_almost_4_years/)",
        "date": 1739379280.0
    },
    {
        "title": "South Korea’s Mint Halts Gold Bar Sales as Supply Tightens",
        "text": "",
        "date": 1739408917.0
    },
    {
        "title": "Breaking: Arm Holdings 🤝🏻 Meta",
        "text": "",
        "date": 1739472917.0
    },
    {
        "title": "APP$$ $$Gain37K\nThis stock opened up as high as 37% and would have pulled back on a big positive and obviously I caught it. This kind of ope",
        "text": "",
        "date": 1739468626.0
    },
    {
        "title": "PPI - US producer prices rise slightly above expectations in January",
        "text": "",
        "date": 1739453963.0
    },
    {
        "title": "Wendy’s beats on same-store sales for the first time in seven quarters, but guidance is weak",
        "text": "Wendy’s Co.’s stock rose 1.3% early Thursday, after the fast-food chain posted better-than-expected fourth-quarter earnings and ended six quarters of same-restaurant sales shortfalls, offsetting soft guidance for 2025.\n\nWEN had net income of $47.5 million, or 23 cents a share, for the quarter, compared with $46.9 million, or 23 cents a share, in the year-earlier period. Adjusted for one-time items, its EPS of 25 cents beat of the 24-cent FactSet consensus.\n\nRevenue rose 6.2% to $574.3 million, also ahead of the $563 million FactSet consensus.\n\nSame-restaurant sales were up 4.3%, while FactSet was expecting a 3.2% rise. That metric was a positive, coming after six straight quarters of misses.\n\nThe stock has fallen 25.6% in the last 12 months amid the weakness, while the S&P 500 \n\n[Full Article](https://www.marketwatch.com/story/wendys-better-than-expected-quarter-offsets-soft-2025-guidance-f441bd61?mod=home-page)",
        "date": 1739464830.0
    },
    {
        "title": "Robinhood hits record $1 billion in Q4 revenue, boosted by 500% jump in crypto fees",
        "text": "Robinhood reported an almost 500% jump in revenue from cryptocurrency transactions on Wednesday as the online brokerage and trading app announced a record-breaking quarter for profit and revenue. Crypto revenue rose to $358 million in Q4, and overall revenue skyrocketed 37% to $1.01 billion from the previous quarter. With an earnings per share of $1.01, the trading app posted a net income of $916 million and beat analysts’ predictions of 42 cents, according to data from the *Wall Street Journal*. \n\nYear-over-year, Robinhood’s revenue more than doubled. The online brokerage notched quarterly records in revenue, net income, and revenue from crypto transactions.\n\nIn after-hours trading, shares jumped almost 7% to nearly $60. Its stock is up more than 360% since the beginning of 2024.\n\n“We hit the gas on product development in 2024,” Vlad Tenev, the CEO of Robinhood, said in a statement.\n\nRobinhood’s fourth-quarter record-breaking returns follows a surge in crypto trading on its platform as mom-and-pop investors flocked to the platform in 2024 amid a crypto bull market.\n\nCrypto fees for the company hit close to a three-year low in the third quarter of 2023, accounting for $23 million, before climbing to $126 million in the beginning of 2024.\n\nThe company's current record quarter for crypto eclipsed its previous high water mark in 2021, when Robinhood posted $233 million amid an earlier bull market that was marked by a surge of Dogecoin trading on its platform.\n\nDigital assets have been a major business line for Robinhood for more than five years.\n\nIn 2018, the company began to let users buy and sell Bitcoin and Ether, the world’s two largest cryptocurrencies by market capitalization.\n\nThe firm eventually expanded the number of digital assets it offered users and listed Solana, Polygon, and Cardano, among other tokens. It also unveiled a crypto wallet and created its own crypto payments rails, which allows customers on other crypto apps to buy digital assets through Robinhood.\n\nThe company’s crypto ambitions have landed it in the crosshairs of the Securities and Exchange Commission. In February 2023, the regulator issued subpoenas to Robinhood concerning its crypto business. One year later, in May 2024, agency lawyers notified the online brokerage that they had recommended that the SEC pursue litigation against the firm.\n\nHowever, after the election of Donald Trump, the regulator has signaled a change in its combative crypto policy, as Mark Uyeda, the acting chairman, announced a new crypto task force in January to hammer out rules for the industry.\n\nAnd Tenev, Robinhood’s CEO, has remained consistent in his belief that crypto is part of finance’s future. He said he believes tokenization, or when financial assets are put on blockchains, is the “next transition” for financial services, he told *Fortune* in July.\n\n# [Robinhood hits record $1 billion in Q4 revenue, boosted by 500% jump in crypto fees](https://www.msn.com/en-us/money/companies/robinhood-hits-record-1-billion-in-q4-revenue-boosted-by-500-jump-in-crypto-fees/ar-AA1yVPCl?ocid=BingNewsVerp)\n\n  \n",
        "date": 1739397797.0
    },
    {
        "title": "Bought the dip",
        "text": "",
        "date": 1739404832.0
    },
    {
        "title": "24-hour returns on first two options trades",
        "text": "So this is how people become degenerate gamblers eh",
        "date": 1739461566.0
    },
    {
        "title": "Spotify Buy/Sell/Holf",
        "text": "Spotify Buy/Sell/Hold, is it overvalued?\n\nI've been bullish on SPOT for years, started buying at $73 in 2022 and DCA'd up to a cost basis of $120, so I've done well so far but is my original thesis playing out and still intact?\n\n**OG Thesis:**\n\nMy original thesis, shortened so we can focus on today and the future: The majority of Spotify users are ad tier (at the time around 60%), but they made up less than 15% of revenue. Spotify was focused on growing MAUs instead of real monetization, but once the MAU growth starts to slow they will pivot more into monetization. I'm not concerned about more ads scaring away users, some will go to Subscriber tier and the others weren't profitable anyway, since Spotify's expenses are somewhat tied to how many listens they get having less listeners that aren't profitable isn't necessarily bad. Additionally, Spotify started getting into podcasts and I saw that being a driver of future growth. Lastly, I think they have pricing power on subscriptions.\n\n**Past Performance:**\n\nSo how has Spotify done over the last 2 years (from Q2 22 to Q4 24)?\n\n|\\#'s in Thousands|Q2 2022|Q4 2024|Change|\n|:-|:-|:-|:-|\n|MAUs|433|678|54.3%|\n|Revenue|2,864|4,242|48.1%|\n|Net Income|(125)|367|393.6%|\n|Free Cash flow|37|877|2,270.3%|\n\nKey factors tying to my thesis: 2022 Ad tier MAU was 59.12% and contributed to 12.52% of revenue. In 2024 it was 62.96% and 12.66% respectively.\n\nMy thoughts based on my original thesis: I did expect Ad tier MAU to begin to contribute more to revenue by now, especially with being an even larger percent of MAU. I like to invest thinking 5 years ahead minimum, so at the time I was thinking by 2027 Ad tier should contribute to 30% of revenue (while maintaining around the 60% of MAU area), there is time left for them to get to the 30% area I wanted to see but I did expect to see SOME improvement. Spotify is also still growing MAU at >10% so I will give some slack in not fully monetizing yet. Spotify has done 2-3 Sub tier price increases with another one announced, so I was right they have pricing power (I wish they used it more on ad tier than loyal Subscribers tho). I am happy with their podcast growth, thankful they realized to cut their podcast spending though.\n\nOverall thoughts: Clearly Spotify figured out the cost cutting and improved FCF and net income at a very healthy clip. I'm also generally happy with the MAU growth but slightly disappointed in Revenue growth. Back to the Ad tier not carrying their weight there. I'm also very pleased with the introduction of audiobooks and video integration. Both I think can be growth drivers with video having huge potential. Personally, as a user, I think they are pricing audiobooks too aggressively for it to do as well as it can.\n\n**Spotify's future:**\n\nI did my own rough estimates for their MAU, revenue, and FCF in 10 years. Then I did an estimate using Spotify's target 1B MAU by 2030 and expanding growth another 5 years.\n\nMy method:\n\nI used 4%/yr MAU growth (Subs growing 6% and Ad 2.5%). I won't bore you with too much info, but I made 6 revenue estimates using varying growth of Rev/MAU for Ad and Sub tier. Then I estimated each estimates FCF using 15% (current rate), 20% and 25%.\n\n**M1**\n\n|In thousands|Minimum Estimate|Max Estimate|\n|:-|:-|:-|\n|**Revenue**|29,028|92,227|\n|**Free Cash Flow**|5,854|23,057|\n\nNow using Spotifys estimate of 1B MAU by 2030 then 5%/yr to 2035. I used the same method for revenue and FCF estimates.\n\n**M2**\n\n|In thousands|Minimum Estimate|Max Estimate|\n|:-|:-|:-|\n|**Revenue**|47,964|118,578|\n|**Free Cash Flow**|7,195|29,681|\n\nMy minimum revenue estimates used 3%/yr growth rev/MAU for both Ad and Sub tier. My max uses 8% for subs and 31% for ad tier BUT with a 10% cut to ad tier MAU to account for upset users. Figures based on average yearly revenue per user, See below:\n\n|Tier|FY 2024 Average|Minimum Estimate|Max Estimate|\n|:-|:-|:-|:-|\n|Ad|56|75|120|\n|Subscriber|5|7|75|\n\n**Valuation:**\n\nI like reverse DCF calcs to find what todays valuation should be. For my estimates I used 4% terminal growth and 11% Discount rate. For estimates with Spotify MAU growth I used 3% terminal and 11% Discount rate, with the faster growth I expect less runway for the terminal growth. I will show my RDCF valuations for the Average and Max FCF estimates, not the minimum since it is absolutely overvalued if it doesn't surpass min estimates.\n\nPrice today: **$647.66**\n\n|Average M1|Max M1|Average M2|Max M2|\n|:-|:-|:-|:-|\n|548.26|841.90|638.41|958.93|\n|(15.35%)|30.50%|\\-1.13%|48.17%|\n\n**Final Thoughts:**\n\nAs the valuations show, Spotify has upside if they surpass some pretty hefty targets. But even hitting my average estimates doesn't give much upside at the current price, M2 average assumes 23.5% FCF growth for 10 yrs which is no joke. I'm still bullish on the company, but I'm **Holding** for now with buying as an option on a 12%+ dip from current prices.\n\n**Thesis going forward:**\n\nMy original thesis is mostly still in play. I see a future where monetizing the ad tier can lead to significant growth.  Podcasts, audiobooks and video have huge potential and can drive growth the hit my highest estimates. Podcasts and audiobooks gives support to price increases and better advertising opportunities while also having higher potential margins due to less royalties. Video can drive more streaming hours and grab some market share from Youtube or other streamers. Spotify is integrating it slowly and they didn't mention tapping into a youtube-like video platform but if they can successfully pull it off any market share gain will lead to better than expected growth.\n\nFor me to buy more I will like to see video progress and/or higher ad RPU or achieving 15%+ Subscriber growth. At current valuations I don't see a way to justify the valuation with less than 25% of revenue coming from Ad tier. It just isn't sustainable to raise subscription prices enough to justify the valuation, which is why 15%+ growth here could sway me to buy.\n\nSelling would involve losing MAU without significantly increasing ad tier RPU, stagnant MAU and RPU growth, or ad tier growing higher than 65% without contributing more than 15% of revenue. I'd probably sell some if it increases above $730, it'd be my first 10-bagger and over-priced for me. So I'd want to lock in that kind of gain and buy again at a better valuation.\n\n\n\nRepost to add positions",
        "date": 1739481964.0
    },
    {
        "title": "Just gonna keep holding!",
        "text": "",
        "date": 1739477542.0
    },
    {
        "title": "Balls Deep in $BB",
        "text": "$BB Amazing company transformation. Looking up here onwards. HODL until retirement. ",
        "date": 1739417720.0
    },
    {
        "title": "Posts, die Atos Shit Stock beinhalten werden gelöscht und gebannt. An die Bots und pump&dump da draußen lasst es einfach",
        "text": "",
        "date": 1735471730.0
    },
    {
        "title": "Willkommen im r/wallstreetbetsGER Live-Chat!",
        "text": "",
        "date": 1623351768.0
    },
    {
        "title": "Sollte ich Vollzeit traden?",
        "text": "",
        "date": 1739534065.0
    },
    {
        "title": "Rheinmetall 1500€ dieses Jahr.",
        "text": "Ich halte es nicht nur für mögliche, sondern sage euch heute, dass wir noch diese Jahr einen Kurs von 1500€ sehen werden. \n\nIn Zahlen ist das eine Marktkapitalisierung von 58 Milliarden Euro bei einem KGV (sollte der Umsatz nicht weiter wachsen) von 120. \n\nDas ganze mag sich unrealistisch anhören, aber schauen wir uns doch mal Firmen wie Palantir, Tesla und Carvana an. KGB bedeutet nichts mehr. \n\nDie Auftragsbücher von Rheini sind bis zum platzen gefüllt, aktuell rund 50 Milliarden Euro bei einem Gesamtumsatz von 7 Milliarden in 2025. Und da ist noch nicht Ende, Rüstungsausgaben werden von 2% BIP auf mindestens 3,5% erhöht, Trump fordert sogar 5%. Regierungswechsel mit Fokus auf die Wirtschaft steht auch bald an. \n\nAuch ein Ende des Krieges in der Ukraine kann dieses Wachstum nicht stoppen denn die Lage bleibt angespannt. Russland wird seine Kriegsmacht weiter stärken, Konflikte in Nahost und Taiwan sorgen für weitere Unsicherheit. \n\nWas denkt ihr? Ich bin dumm, wir sind im Wallstreetbets, take everything with a grain of salt.",
        "date": 1739531792.0
    },
    {
        "title": "Rheinmetall 7x Hebel moralisch vertretbar?",
        "text": "Krieg is Krieg aber Geld verdienen ist Geld verdienen.",
        "date": 1739521535.0
    },
    {
        "title": "Rachehebel hat mein Wochenende gerettet.",
        "text": "Manchmal klappt es halt doch mit der Rache ",
        "date": 1739538062.0
    },
    {
        "title": "Petition zur Einführung verpflichtender WKN Inkludierung",
        "text": "Hallo, meine ebenfalls geldgierigen Freunde.\n\nWie der Titel schon erahnen lässt, fände ich es wichtig und richtig, wenn wir in Zukunft bei Trade Postings die WKN vom jeweiligen Derivat inkludieren.\n\nGefühlt wird bei jedem einzelnen Posting gefragt „Welcher Hebel?“ oder „Welche WKN/ISIN?“\n\nWürde vieles einfacher und transparenter machen. Was meint ihr?",
        "date": 1739547674.0
    },
    {
        "title": "🫡",
        "text": "",
        "date": 1739525738.0
    },
    {
        "title": "Danke Rheiner 📈",
        "text": "Halte das noch bis heute Abend ",
        "date": 1739544634.0
    },
    {
        "title": "800 rheiner würde geschaft 🫡",
        "text": "",
        "date": 1739526215.0
    },
    {
        "title": "Ich versuche eine AI zu bauen",
        "text": "Servus zusammen, ich versuche mithilfe von KI und kaum Ahnung in Softwareentwicklung, eine KI zu bauen, mit der ich Börsenkurse, anhand der allgemeinen Stimmung/Keywords auf Reddit und anderen Portalen, vorhersagen möchte. Ob das funktioniert keine Ahnung, was ich da mache, keine Ahnung, aber es macht Spaß. Hab Euch lieb und bin für Tipps immer offen. ",
        "date": 1739546206.0
    },
    {
        "title": "15:29 rein 15:33 raus",
        "text": "",
        "date": 1739544355.0
    },
    {
        "title": "Rheiner am reinhauen. Heute schon 10% der Gute😎",
        "text": "",
        "date": 1739544125.0
    },
    {
        "title": "Ich habe mir ein Mahnmal errichtet",
        "text": "Als ich anfing mit Aktien habe ich einst der redditcommunity blind vertraut.. aus einem post das wird steigen wurde ein Mahnmal an mich selbst .. ich werde es im plus verkaufen habe ich mir geschworen und solange werde ich es halten um nie wieder so einen krassen fehler zu begehen...",
        "date": 1739518151.0
    },
    {
        "title": "Wrm sinkt der h Sohn",
        "text": "",
        "date": 1739543878.0
    },
    {
        "title": "An alle 10 Euro Investoren 🚨",
        "text": "Bitte hört auf diese Gruppe mit Müll zu füllen, das ist wirklich to much. Das interessiert keinen und behindert uns die guten Tipps zu filtern. Jeder hat mal klein angefangen allerdings macht alles unter 100 Euro wirklich kein Sinn hier! ",
        "date": 1739477988.0
    },
    {
        "title": "Was zum f*ck bin ich da gerade sehen - geil hahah",
        "text": "",
        "date": 1739482724.0
    },
    {
        "title": "Los",
        "text": "",
        "date": 1739520555.0
    },
    {
        "title": "Kleiner Freitagsshort",
        "text": "",
        "date": 1739544368.0
    },
    {
        "title": "Erstmal plus machen",
        "text": "",
        "date": 1739531811.0
    },
    {
        "title": "Hebel muss nur hoch genug sein, dann steigt man auch nicht zu spät ein 🚀",
        "text": "",
        "date": 1739524672.0
    },
    {
        "title": "Hims & Hers... hat geschmeckt.",
        "text": "",
        "date": 1739522207.0
    },
    {
        "title": "30er Hebel jetzt heißt es hoffen",
        "text": "",
        "date": 1739540576.0
    },
    {
        "title": "Dax short friday money glitch",
        "text": "Wer ist noch dabei? \n",
        "date": 1739546904.0
    },
    {
        "title": "Danke Hensoldt",
        "text": "",
        "date": 1739537710.0
    },
    {
        "title": "Langweilig reich werden kann jeder",
        "text": "Heute ist mir bewusst geworden, dass man Gewinn macht, wenn man die Aktie antizyklisch, mit geringem Hebel (x4) kauft und sie vorher umfangreich ansieht. \n\nDa allerdings nun das Loch, welches etliche 20er Hebel in mein Portfolio gerissen haben teilweise gestopft ist (zum großen Teil auch durch meine untealisierte position in „niewieder“) werde ich mich wieder dem Wetten widmen. \nLangweilig reich werden kann jeder (ich rede mir nur meine spielsucht schön)\n\nDiesen Tag werde ich für immer in Erinnerung behalten und mich bei dem nächsten Mal ärgern wieso ich nicht einen geringeren Hebel gewählt habe, während der Kurs zärtlich mein dummes Knockout küsst, bevor er durch die Decke geht.\n\nHabt einen schönen Freitag!",
        "date": 1739529496.0
    },
    {
        "title": "Hätte hätte Fahrradkette",
        "text": "Tja, falsch gepokert 🫡",
        "date": 1739544696.0
    },
    {
        "title": "Danke rheiner",
        "text": "",
        "date": 1739521924.0
    },
    {
        "title": "Börsen nachrichten Quelle",
        "text": "kann jemand eine gute Quelle (vorzugsweise mit app) für aktuelle und gute Börsen Nachrichten empfehlen? ",
        "date": 1739537922.0
    },
    {
        "title": "Rheinmetall bei 800€",
        "text": "Rheinmetall unaufhaltsam",
        "date": 1739526191.0
    },
    {
        "title": "Nicht vergessen! Montag ist ein Feiertag in den USA",
        "text": "",
        "date": 1739542787.0
    },
    {
        "title": "0,80€ mitnehmen für Ayran?",
        "text": "",
        "date": 1739535825.0
    },
    {
        "title": "Wieso redet eig keiner über Innodata?",
        "text": "Rennt ja übel ",
        "date": 1739530648.0
    },
    {
        "title": "NVIDIA übers Wochenende halten mit Ausblick auf nächste Woche ?",
        "text": "NVIDIA ",
        "date": 1739546125.0
    },
    {
        "title": "Wie reagieren die Fettbürger auf den Kurssprung von GME",
        "text": "Werden sie Gewinne mitnehmen oder nachkaufen auf Grund der Bitcoin Gerüchte🤔",
        "date": 1739534914.0
    },
    {
        "title": "Rheinmetall big fail",
        "text": "Gestern abend um 21:50 wollte ich noch schnell Rheinmetall long gehen mit 2k\n\nHabe heute aufs Handy geschaut und gesehen dass ich ausversehen short gedrückt habe\nBin jetzt bei -40%\nSoll ich direkt raus oder noch warten ob wieder runtergeht?",
        "date": 1739544574.0
    },
    {
        "title": "Anschnallen",
        "text": "",
        "date": 1739543384.0
    },
    {
        "title": "Rheini: 2 mal knockout offtime > gehalten > hebel gibt fett",
        "text": "War 2 Mal (fast 3 Mal) knockout nach 17:30. Am nächste än morgen jeweils wieder drin.\nHeute ausgecashed bei 795, war mir dann zu heiß als es von 801€ gefallen ist. ",
        "date": 1739527280.0
    },
    {
        "title": "Klappt super der erste große Trade",
        "text": "",
        "date": 1739548569.0
    },
    {
        "title": "Nvidia kauft sich bei #Nebius ein, einem Spezialist für Rechenzentren und KI\nNeben Nebius hat sich Nvidia auch bei WeRide, einem Entwickler autonomer Fahrsysteme eingekauft.",
        "text": "",
        "date": 1739542089.0
    },
    {
        "title": "Kann mir jemand bitte sagen was bei Gamestop los ist? Ich war -3000€ und bin auf einmal im Grünen?",
        "text": "",
        "date": 1739483017.0
    },
    {
        "title": "2 Minuten Arbeit",
        "text": "In den letzten 4 Tagen mich auf 20.000 hoch gearbeitet und nun nicht den Hals voll bekommen.",
        "date": 1739437151.0
    },
    {
        "title": "Alphabet",
        "text": "Diese Penner missbrauchen mein Depot ",
        "date": 1739546601.0
    },
    {
        "title": "Rheinmetal heute bei 800?",
        "text": "Am Wochenende ist SiKo in München. Würdet ihr das als Chance sehen die 800€ marke zu knacken?",
        "date": 1739521003.0
    },
    {
        "title": "Hims and hers",
        "text": "Läuft ja grad bei denen\n\n10 Tage Financial Release bissel was reinbuttern und auf paar Prozente hoffen? ",
        "date": 1739546208.0
    },
    {
        "title": "Xrp meine Löwen 🚀",
        "text": "",
        "date": 1739524418.0
    },
    {
        "title": "Rheiner jetzt shorten?",
        "text": "",
        "date": 1739526695.0
    },
    {
        "title": "Coinbase",
        "text": "Macht euch bereit alles zu verlieren  (bin Teil davon)",
        "date": 1739540181.0
    },
    {
        "title": "immer noch 7x Hebel Auf Rheinmetall",
        "text": "Leute Danke für die zahlreiche Unterstützungen in den letzten Stunden. Seit dem letzten Post hab ich ein paar Stunden geschlafen jetzt Investment fast verdoppelt. STAY LONG. Ich seh Rheinmetall bei 850€+",
        "date": 1739545516.0
    },
    {
        "title": "Warum Optionsscheine mit schon erreichten Strike Preis?",
        "text": "Rheiner steht doch schon bei über 825€? Also warum ist dieser Optionsschein noch handelbar oder verstehe ich da etwas falsch? ",
        "date": 1739545202.0
    },
    {
        "title": "Hebel Millionär (näher dran als Elon)",
        "text": "Nachdem gestern jemand meinte man soll hier nicht so kleine pissgewinne reinhauen kommt hier mein erster Hebel, hat mir das Frühstück finanziert😎",
        "date": 1739525560.0
    },
    {
        "title": "Rheinmetall 🚀",
        "text": "",
        "date": 1739524786.0
    },
    {
        "title": "4100€ 8x Hebel. Dip Gekauft. Lasset die Langen spiele beginnen PALO ALTO 🚀🚀",
        "text": "",
        "date": 1739520227.0
    },
    {
        "title": "Microsoft",
        "text": "Jungs was haltet ihr von Microsoft, Long oder Short? ",
        "date": 1739543549.0
    },
    {
        "title": "Bros lernt von den Fehlern",
        "text": "Wir müssen schlauer werden Leute und speziell der Post mit den „wieviel habt ihr bisher verloren“ hat mich bisschen angesteckt.\nMache das ganze auch schon bisschen länger und denke wir können uns selbst und einigen neuen (die denken das sie mit dem Scheiss plus machen können Lol) vllt einige Verluste ersparen.\nAlso haut mal eure Tipps/Learnings raus die ihr im Casino gelernt habt!\n\n- wenn man drüber nachdenkt zu verkaufen weil „viel plus“ sollte man einen Großteil verkaufen.\n- beim längerfristigen Handel benutze ich hauptsächlich Call/Put Optionen oder Call/Put scheine \n- vor wichtigen FED Entscheidungen nie mehr mit Hebel >50 rein. Sämtliche Stopps oben wie unten werden geholt.\n- immer ein Depot für Sparplan und eins für gamblen haben, dann bringt man nichts durcheinander ;)",
        "date": 1739495402.0
    },
    {
        "title": "Wiso lese ich hier nichts von Siemens?",
        "text": "In den letzten Wochen/ Monaten war Siemens (nicht Siemens Energy)  ein absolutes Zugpferd, ich weiß selbst nicht genau wie ich darauf gekommen bin, dennoch hat sich der Kauf bisher absolut gelohnt. Freue mich auf 13 Uhr, Dividenden-earning (ca 500€ )und dann 16% aufwärts Gewinnmitnahme \nDanke Siemens ",
        "date": 1739529229.0
    },
    {
        "title": "Moderna geht Richtung Erdkern",
        "text": "",
        "date": 1739536226.0
    },
    {
        "title": "Ich hoffe ihr habt Palo Alto lange Hosen an",
        "text": "",
        "date": 1739539682.0
    },
    {
        "title": "NEUES ATH BEI RHEINER🚀🚀",
        "text": "",
        "date": 1739529316.0
    },
    {
        "title": "Tesla Kurzhosen ?",
        "text": "Irgend ein Typ hier im Sub meinte mal das Tesla ab 350 wieder abschmiert, ein Löwe hat gesprochen.",
        "date": 1739546114.0
    },
    {
        "title": "Verfolgt jemand die Strategie Derivate zu kaufen wenn eine Schwelle überschritten wird (Beispiel als Beitrag)",
        "text": "",
        "date": 1739538142.0
    },
    {
        "title": "Fliegt heute XRP nach oben?",
        "text": "",
        "date": 1739528088.0
    },
    {
        "title": "Rheiner übers Wochenende halten?",
        "text": "Was meint ihr? Weg damit? ",
        "date": 1739545833.0
    },
    {
        "title": "Smci🫦",
        "text": "",
        "date": 1739545618.0
    },
    {
        "title": "Ich will sterben",
        "text": "",
        "date": 1739477585.0
    },
    {
        "title": "Kann man eure kurzen Hosen schon auf vinted kaufen ?",
        "text": "",
        "date": 1739544999.0
    },
    {
        "title": "Alles rot (again)",
        "text": "",
        "date": 1739544829.0
    },
    {
        "title": "Rheiner jetzt short bis heute abend?",
        "text": "",
        "date": 1739544804.0
    },
    {
        "title": "Reddit chat rooms could soon drive hedge fund investor bets",
        "text": "",
        "date": 1739526814.0
    },
    {
        "title": "Ein Screenshot, damit wir alle nochmal günstig nachkaufen können",
        "text": "Sorry wenns jetzt fällt, aber ich will da jetzt all in gehen.",
        "date": 1739526794.0
    },
    {
        "title": "Kann man da noch irgendwas rausholen?",
        "text": "",
        "date": 1739544389.0
    },
    {
        "title": "Rainer wird nicht dippen.",
        "text": "Erst nach der Konferenz oder gar nicht. Aber auf jeden Fall vor börsenschluss verkaufen",
        "date": 1739526452.0
    },
    {
        "title": "Bevorstehende Earnings für heute",
        "text": "* Enbridge ([ENB](https://stocknear.com/stocks/ENB)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 4,78 Mrd. USD (-42,42 % im Jahresvergleich) und einen Gewinn je Aktie von 0,52 USD (10,64 % im Jahresvergleich).\n* TC Energy ([TRP](https://stocknear.com/stocks/TRP)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 2,42 Mrd. USD (-22,24 % im Jahresvergleich) und einen Gewinn je Aktie von 0,68 USD (-31,31 % im Jahresvergleich).\n* Fortis ([FTS](https://stocknear.com/stocks/FTS)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 2,08 Mrd. USD (-1,89 % im Jahresvergleich) und einen Gewinn je Aktie von 0,57 USD (7,75 % im Jahresvergleich).\n* Moderna ([MRNA](https://stocknear.com/stocks/MRNA)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 942,84 Mio. USD (-66,46 % im Jahresvergleich) und einen Gewinn je Aktie von -2,68 USD (-587,27 % im Jahresvergleich).\n* Magna International ([MGA](https://stocknear.com/stocks/MGA)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 10,34 Mrd. USD (-1,09 % im Jahresvergleich) und einen Gewinn je Aktie von 1,52 USD (14,29 % im Jahresvergleich).\n* Essent Group ([ESNT](https://stocknear.com/stocks/ESNT)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 313,88 Mio. USD (5,59 % im Jahresvergleich) und einen Gewinn je Aktie von 1,65 USD (0,61 % im Jahresvergleich).\n* BGC Group ([BGC](https://stocknear.com/stocks/BGC)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 570,00 Mio. USD (10,30 % im Jahresvergleich) und einen Gewinn je Aktie von 0,25 USD (19,05 % im Jahresvergleich).\n* Portland General Electric ([POR](https://stocknear.com/stocks/POR)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 663,32 Mio. USD (-7,87 % im Jahresvergleich) und einen Gewinn je Aktie von 0,35 USD (-47,76 % im Jahresvergleich).\n* Sensient Technologies ([SXT](https://stocknear.com/stocks/SXT)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 375,10 Mio. USD (7,39 % im Jahresvergleich) und einen Gewinn je Aktie von 0,64 USD (25,49 % im Jahresvergleich).\n* Newmark Group ([NMRK](https://stocknear.com/stocks/NMRK)) wird heute vor Börsenöffnung berichten. Analysten schätzen einen Umsatz von 790,76 Mio. USD (5,80 % im Jahresvergleich) und einen Gewinn je Aktie von 0,48 USD (4,35 % im Jahresvergleich).\n\n  \nLink für alle Infos: [https://stocknear.com/](https://stocknear.com/)\n\nPS: Ich poste täglich neue Beiträge in meinem eigenen Subreddit [r/stocknear](https://www.reddit.com/r/stocknear/).\n\nWenn ihr nicht wollt, dass Stocknear insolvent wird, wäre es mega cool, wenn ihr mich [supporten ](https://stocknear.com/pricing)könnt! 🙌",
        "date": 1739525946.0
    },
    {
        "title": "Palo Alto schmiert ab",
        "text": "Was ist los 😥😥😥",
        "date": 1739543686.0
    },
    {
        "title": "Rheiner 🚀 🚀 🚀 🚀 🚀",
        "text": "[https://www.n-tv.de/politik/Olaf-Scholz-will-fuer-Aufruestung-Notlage-im-Bundestag-erklaeren-article25563349.html](https://www.n-tv.de/politik/Olaf-Scholz-will-fuer-Aufruestung-Notlage-im-Bundestag-erklaeren-article25563349.html)\n\n\"Zudem sollte der Bundestag laut dem Bundeskanzler möglichst schnell einen Beschluss fassen, wonach der Krieg in der Ukraine und seine \"schwerwiegenden Folgen für die Sicherheit Deutschlands und Europas als Notlage im Sinne des Artikel 115 Absatz 2 des Grundgesetzes eingestuft werden\".\"\n\n\"Dies würde laut Scholz dazu führen, dass die Unterstützung der Ukraine nicht weiter zulasten anderer Aufgaben gehe, die der Staat \"gegenüber seinen Bürgerinnen und Bürgern zu erfüllen hat\". Zudem will der Bundeskanzler \"Diskussionen\" in der EU voranbringen, wie man den Aufbau einer starken europäischen Verteidigungsindustrie \"wirklich hinbekomme\".\"",
        "date": 1739535689.0
    },
    {
        "title": "Nasser 🦡",
        "text": "Ich shorte heute, komme was wolle! (mir geht es nicht mehr gut)",
        "date": 1739534630.0
    },
    {
        "title": "Huiii Hims and Hers",
        "text": "Hier gibt’s keinen Inhalt ich freu mich nur dass ich zum ersten Mal was richtig mache (nur Glück gehabt)",
        "date": 1739528938.0
    },
    {
        "title": "Hebel",
        "text": "Fürs erste mal 🤷‍♂️",
        "date": 1739534547.0
    },
    {
        "title": "PI Network❤️ habt ihr auch geschürft? Das wird eine tolle Sache🤙🏻",
        "text": "",
        "date": 1739534225.0
    },
    {
        "title": "Genial",
        "text": "Genial",
        "date": 1739524183.0
    },
    {
        "title": "Einstieg ins Day Trading – Wie soll ich mein Depot umstrukturieren?",
        "text": "Hey Leute,\n\ndirekt nach meinem 18. Geburtstag habe ich ein Depot bei Trade Republic eröffnet, um Erfahrungen am Kapitalmarkt zu sammeln (seit ca. drei Monaten). Ich hatte sowohl gute als auch schlechte Positionen und nutze die kostenlose Version von TradingView für Chartanalysen. Aktuell habe ich gute Positionen bei Rheinmetall und Nvidia.\n\nIn den letzten Wochen habe ich mich etwas mit dem Thema Day Trading beschäftigt und möchte nun damit anfangen. Wie sollte ich mein Depot umstrukturieren, und welche Positionen würdet ihr empfehlen zu verkaufen? Außerdem: Welche Broker könnt ihr mir generell empfehlen, insbesondere für das Day Trading mit Krypto und Aktien?\n\n",
        "date": 1739541321.0
    },
    {
        "title": "In heiligen Amumbo umschichten",
        "text": "Momentan habe ich das meiste in ungehebelte normale ETFs. Wie wir alle wissen, ist das Quatsch. \n\nWie würdet ihr das ganze umziehen? Alles auf einmal verkaufen und dann Häppchen weise Amumbo nachkaufen? ",
        "date": 1739527281.0
    },
    {
        "title": "NVIDIA",
        "text": "Heute 15:00 nach rechts? ",
        "date": 1739532867.0
    },
    {
        "title": "Guten Morgen! Hier ist mein Überblick über die Ereignisse von gestern und ein Ausblick auf das, was heute wichtig wird.",
        "text": "",
        "date": 1739532510.0
    },
    {
        "title": "Ich fühle mich verarscht",
        "text": "Vor gut über einer Woche habe ich den Sub entdeckt, wurde vom Reihner Hype mitgerissen und bin Long gegangen, woraufhin es in den Keller ging damit. Seit dem hab ich nur geblutet und jetzt ist der Sämmel wieder oben und ich nicht dabei. Ich hasse euch und bis morgen",
        "date": 1739450958.0
    },
    {
        "title": "DAX Short",
        "text": "Glaubt ihr heute ist der Tag ? ",
        "date": 1739521947.0
    },
    {
        "title": "Beste Investition(glaube ich)",
        "text": "\nAbseits von Derivaten war Rheinmetall meine erste Aktie vor knapp 2 Jahren.\nBin 18 geworden, Abi fertig und zum Bund gegangen und hab mit dem ersten Sold bisschen was in Rheinmetall gekappt, Buy In damals um die 300€ gewesen. \n\nKönnte mir dafür heute noch selbst ein Blasen. Abseits davon ärger ich mich, dass es damals nur so wenig waren hätte mal mein ganzen Sold in der Rüstungsindustrie verbraten sollen statt alles in meinen alten 3er Bmw. 🚀",
        "date": 1739525975.0
    },
    {
        "title": "Rhainer.W",
        "text": "Wieder in Gönnerlaune unser Freund vom Schaurigen Berg ?",
        "date": 1739525651.0
    },
    {
        "title": "Meine Strategie Hebel (Coinbase etc.) aufgrund Nachfragen",
        "text": "Aufgrund einiger Nachfragen hier mal meine Hebelstrategie. Ist natürlich nur meine Meinung. Ich kaufe eine Aktie mit Hebel (aktuell Coinbase)5x. Wenn ich gekauft habe setze ich sofort einen Stopp bei ca. 15% unter meinem EK. Das bin ich bereit zu verlieren. Jetzt warte ich bis die Aktie Gewinn gibt (steigt oder fällt) und ziehe dann sofort den Stopp immer höher nach. So das ich quasi nicht mehr im Verlust landen kann! \n ",
        "date": 1739464430.0
    },
    {
        "title": "Den Rheini kastrieren?",
        "text": "Meint ihr Rheinmetall kann jetzt geshortet werden?",
        "date": 1739538288.0
    },
    {
        "title": "Bitte seid ehrlich, wie viel Geld habt ihr mit Hebeln insgesamt schon verzockt?",
        "text": "Ich beginne und werfe 2.600€ in die Mitte……",
        "date": 1739481654.0
    },
    {
        "title": "hebeln lernen",
        "text": "ich muss euch jetzt Fragen. \nWoher habt ihr euer Wissen übers hebeln gelernt? durch probieren, Lektüre oder Videos usw.\nUnd woher holt ihr eure Infos wann und was ihr Long/short setzen wollt? \n",
        "date": 1739530033.0
    },
    {
        "title": "Xiaomi, Byd",
        "text": "Byd und Xiaomi Long heut abend ,damit die Chinesen über Nacht wieder ordentlich pumpen können?",
        "date": 1739529763.0
    },
    {
        "title": "Rheini",
        "text": "Wieviel buttert ihr bei welchem Hebel rein?\nBzw. was hattet ihr rein gebuttert? ",
        "date": 1739529263.0
    },
    {
        "title": "Rheinmetall 15.30?",
        "text": "Gibt es gute Chancen, dass die Fettbürger Rheiner um 15.30 richtig pushen? ",
        "date": 1739529054.0
    },
    {
        "title": "14.02 Daily Post zum Austausch. DAX Alltime high! Wer steigt wo rein?",
        "text": "",
        "date": 1739518207.0
    },
    {
        "title": "Arista networks schlechteste Wahl meines Lebens aktuell uff",
        "text": "Wie kann man so eklig untergehen",
        "date": 1739549549.0
    },
    {
        "title": "ARCH Update - für alle die mir gefolgt sind",
        "text": "\nFreue mich für euch! Hoffe ihr seid eingestiegen!",
        "date": 1739549463.0
    },
    {
        "title": "Paypal nimmt NVIDIA gibt",
        "text": "An Paypal verbrannt und mit NVIDIA das Comeback geholt.",
        "date": 1739549428.0
    },
    {
        "title": "Über Wochenende halten?",
        "text": "",
        "date": 1739549421.0
    },
    {
        "title": "#137 Orangenmann, Tarife und Brennpunkt zu stahl: grün bei Schließung noch möglich?",
        "text": "Liebe Freunde,\n\ndiese Woche mit den lahmen Enten und es wurde natürlich sehr gut!\n\n🎤 Hört euch die Folge an und lasst uns ein wenig Liebe da 🎤\n\n# Wie immer [überall](https://distrokid.com/hyperfollow/monchella420/)\n\n* [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe?si=bdd272c0b6024666)\n* [Apple](https://podcasts.apple.com/de/podcast/mauerstrassenwetten-podcast/id1572657389)\n* [Youtube](https://www.youtube.com/@monchella420?sub_confirmation=1)\n\n**In ewiger Liebe 🥺❤️**\n\nEuer MSW Podcast Team",
        "date": 1739416806.0
    },
    {
        "title": "Tägliche Diskussion - February 14, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1739502061.0
    },
    {
        "title": "Ich wusst gar nicht das TR diese Farbe hat.",
        "text": "Nach 5 Jahren nur Blödsinn machen hatte ich jetzt zwei richtig gute Wochen und bin quasi das erste Mal seit dem Beginn wieder \"Grün\" (OK bin ich eigentlich nicht, TR kann aber die Kurse von gut 3.000 € Verlust in vom Markt genommen Papieren [LLL und FireFinch] nicht darstellen) ",
        "date": 1739544752.0
    },
    {
        "title": "Was ist der nächste Hebel?",
        "text": "",
        "date": 1739514731.0
    },
    {
        "title": "Wann Lambo? 🥲",
        "text": "",
        "date": 1739537208.0
    },
    {
        "title": "Nach einem Jahr und 99% im Minus endlich im Grünen",
        "text": "Ohne Vorwissen direkt nach Depoteröffnung in die Knockouts gesprungen.\nMit meinen letzten 500€ im September dann angefangen semi-lange calls zu kaufen und Glück mit earnings oder dip-Käufen gehabt. \nHatte das ganze Geld eigentlich schon abgeschrieben.",
        "date": 1739471719.0
    },
    {
        "title": "Mein Geld gehört jetzt einem Him oder einer Her",
        "text": "Ist zwar noch nicht realisiert, aber ich glaube nicht, dass das heute am letzten Tag noch dreht ",
        "date": 1739548196.0
    },
    {
        "title": "Amumbo macht das Depot Jumbo",
        "text": "",
        "date": 1739442183.0
    },
    {
        "title": "Lang & Schwarz vor der Erektion 🍆💦",
        "text": "Liebe Freunde,\n\nKomplizierte L&S  Fundamentalanalyse von Dapper-Math:[ €180k YOLO mit Lang & Schwarz](https://www.reddit.com/r/mauerstrassenwetten/comments/1io1toe/180k_yolo_mit_lang_schwarz/) \n\nIch hab mal die Kernaussage IQ-gerecht für diese Community visualisiert.\n\nWenn man dem natürlichen Verlauf eines Langen und Schwarzen folgt, dann könnte das jetzt steil und lang gehen.\n\n🚀🍆🍆💦💦💦\n\nhttps://preview.redd.it/px2d9jxmw1je1.jpg?width=1294&format=pjpg&auto=webp&s=4fddf9c43f10003275df5e41b0c620f52dfef4e9\n\n",
        "date": 1739515799.0
    },
    {
        "title": "Ist das echt???",
        "text": "Bin neu bei Hebeln stimmt das? \nDas war ein 101x Hebel ich kann mir aber nicht vorstellen dass der so gestiegen ist",
        "date": 1739545071.0
    },
    {
        "title": "Was meint ihr? All In Hebel",
        "text": "Alles 5-8er Hebel \nDie drei Positionen ohne Bild ist Arista Networks\nGanz oben Service Now, der Rest sollte klar sein",
        "date": 1739488552.0
    },
    {
        "title": "Scheiße, was da wieder los",
        "text": "",
        "date": 1739435267.0
    },
    {
        "title": "SMA200 vs. SMA375",
        "text": "Ich bin gerade über ein Video von Notgroschen gestoßen, in dem er zeigt, dass es keine Rolle spielt, ob man 200SMA, oder 375SMA (und den Bereich dazwischen) verwendet.\n\nMich würde interessieren was die anderen Backtester hier so dazu meinen?\n\nSollte da etwas dran sein, könnte man ja einige whipsaw trades vermeiden.\n\n[Hier geht's zum Video](https://www.youtube.com/watch?v=4aN3irBdp0g)",
        "date": 1739483132.0
    },
    {
        "title": "Fragen zu Amumbo+SMA",
        "text": "Hallo zusammen,\n\nnach dem ich viele Posts hier gelesen habe, möchte ich endlich selbst in den Amumbo per 200SMA Strategie einsteigen. Ich hätte da noch ein paar Fragen.\n\n\nErstmal ein paar dumme Fragen:\n1. Wenn ich das richtig verstanden habe, dann schaut man sich jeden Tag kurz vor Close an ob die Linie unter- bzw. überschritten wurde. Falls ja, (ver)kauft man dann sofort. Stimmt das so? \n\n2. Reicht es einfach den SPX zu verfolgen oder sollte es schon der MSCI USA sein?\n\n3. Bei ungehebelten ETF macht es soweit ich weiß keinen Unterschied ob man monatlich oder wöchentlich bespart. Ist das hier auch so?\n\n\nDann die etwas interessantere Frage:\n4. Ich habe schon öfter von Ergänzugen zum einfachen SMA gelesen. Z.B. einen Puffer von ein paar Prozent oder eine kürzere Linie wie 10SMA hinzuzufügen um viele Trades zu vermeiden, wo man unnötig verkauft um dann nur ein paar Tage später wieder zu kaufen (falsche Signale) Bringt das wirklich was? Hat jemand empirische Vergleiche der Strategien?\n\nDanke für eure Antworten!",
        "date": 1739458793.0
    },
    {
        "title": "Eure Sicht zu Palantir?",
        "text": "Ich würde gerne eure Einschätzung zu Palantir hören. So einen Zugspitzegraphen habe ich schon lange nicht gesehen. Bin für meine Verhältnisse ziemlich groß mit 15x short rein gegangen, knockout bei 124,15$. Jetzt gehe ich beten.",
        "date": 1739452092.0
    },
    {
        "title": "€180k YOLO mit Lang & Schwarz",
        "text": "**Lang & Schwarz**. Der feuchte Traum einer Investors' Frau. Also warum nicht voll reingehen?\n\n**Über L&S \\[LUS1\\]**\n\n* L&S ist eine **technologie-basierte Handelsplattform** mit 84 Mitarbeiter, der fast **200 Mrd. € an jährlichen Aktien- und Derivateaufträgen** von Privatanlegern abwickelt.\n* Das Unternehmen sorgt für Liquidität und traded Märkte – unter anderem für Comdirect/Commerzbank, BNP Paribas’ Consorbank, Onvista, FlatexDegiro, ING Deutschland, DKB, Targobank, Sparkassen und, ganz besonders, Trade Republic.\n\n**<3x KGV-Bewertung**\n\n* Vor dem Hintergrund des aktuellen Hypes im Privatanlegerbereich--gerne auch dank Mauerstrassenwetten--verzeichnet **L&S Rekordgewinne**: Eine kürzlich erschienene Pressemitteilung meldet ein **Handelsergebnis von 108 Mio. €** im Jahr 2024 ([**Link**](https://www.ls-d.de/investor-relations/finanznachrichten/2025/560-lang-schwarz-aktiengesellschaft-herausragendes-ergebnis-aus-der-handelstaetigkeit-im-vierten-quartal-und-im-gesamtjahr-2024)). Nach Abzug der operativen Aufwendungen dürfte daraus ein Nettogewinn von über 50-60 Mio. € resultieren, wie ich schätze.\n* Rekordgewinne stehen im Verhältnis zu einer **Marktkapitalisierung von 200 Mio. €,** während das Unternehmen eine Netto-Cash-Position von 34 Mio. € aufweist (170 Mio. € liquide Mittel abzüglich 136 Mio. € Finanzschulden, [**Link**](https://www.ls-d.de/media/finanzberichte/zwischenberichte/2024/Zwischenabschluss_6_2024.pdf)). Das bedeutet, dass die bereinigte Bewertung (Marktkapitalisierung abzüglich Netto-Cash) bei etwa einem **KGV von <3x** liegt.\n* Ich erwarte, dass L&S im Jahr 2025 Dividenden in Höhe von 40 Mio. € ausschüttet – das entspricht etwa 20 % des Unternehmenswerts und liegt im Einklang mit der historischen Ausschüttungsquote von 70 %\n\n**Strukturelles Wachstum**\n\n* Das absurd niedrige KGV von<3x mag den Eindruck von \"notleidenden Fundamentaldaten\" erwecken – doch dem ist keineswegs so. Wie gesagt, das Unternehmen erzielt Rekordgewinne bei gleichzeitig keiner Netto-Verschuldung.\n* Darüber hinaus fungiert L&S als **Prime Broker für Trade Republic** ([**Link**](https://support.traderepublic.com/en-nl/705-On-which-trading-market-will-my-orders-be-executed)), Deutschlands marktführenden Retail-Broker, der um **über 30 % jährlich wächst**. Damit ist L&S hervorragend aufgestellt, um weiterhin strukturell zu wachsen.\n\nhttps://preview.redd.it/6o7qlgvwwrie1.png?width=1735&format=png&auto=webp&s=21ba9c283a02732fc81569ebf4b4c860827bdf36\n\n* Das vierte Quartal war Rekord, und **auch der Januar 2025 dürfte neue Rekorde gebrochen haben**, da die boomenden Handelszahlen in Deutschland und Europa in den Januar übergehen ([**Link**](https://www.deutsche-boerse.com/dbg-en/media/news-stories/press-releases/Cash-market-trading-volumes-in-January-2025-4275342)) – die Handelsvolumina im Januar lagen um 10 % über denen des vierten Quartals.\n* Rechnet man den Q4-Gewinn von L&S in Höhe von 42 Mio. € auf das ganze Jahr 2025 hoch (42 Mio. € × 4 = 168 Mio. €) und setzt die jährlichen operativen Aufwendungen von 2024 von etwa 40 Mio. € an, ergäbe sich ein **EBIT von ca. 128 Mio. €, was 64 % der aktuellen Marktkapitalisierung** entspricht. -> Dividenderendite bei einer 60% Ausschüttungsquote wäre dann bei 30+%.\n\n**Abschließender Gedanke**\n\n* L&S weder von Analysten noch von Investmentbanken oder Retail-Plattformen wie Seeking Alpha abgedeckt. Das könnte erklären, warum die Bewertung so absurd von der Realität entkoppelt ist. Um die Inkompetenz der Investor Relations von L&S zu unterstreichen: Selbst die überschwängliche Pressemitteilung, die den Rekord von 108 Mio. € Handelserlösen ankündigt, liegt ausschließlich in deutscher Sprache vor.\n* FY 2024 Resultate am Februar, 21 ([**link**](https://www.ls-d.de/investor-relations/finanzkalender))\n* Kursziel? Keine Ahnung. Aber hoch, hoch, hoch.\n\nhttps://preview.redd.it/gz23t65gwrie1.jpg?width=642&format=pjpg&auto=webp&s=334c17a7d3540ec5a6de1349616f7a1253aa7d5f",
        "date": 1739394533.0
    },
    {
        "title": "Tägliche Diskussion - February 13, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1739415654.0
    },
    {
        "title": "Na, hab ihr euch schon brav die kurze Hose bei Tesla angezogen?",
        "text": "Die kurze Hose sitzt",
        "date": 1739352737.0
    },
    {
        "title": "Blutgeld auf Safari Teil 7",
        "text": "Guten Abend verehrte Safari Teilnehmer und alle anderen Retards hier.\n\nMorgen steht mal wieder die Ernte unserer beliebten Zebra Technologies an.\n\n5 von 6 Predictions von mir haben gestimmt…\nHeute weiß ich einfach nicht was morgen passieren wird.\n\nEs war gerade ein gröberer abverkauf.\nWas man hört, war das letzte Quartal alles andere als Großartig.\nDie Robotersparte nimmt wieder etwas Fahrt auf; aber wird noch Monate brauchen bis sich das endlich auszahlt.\nIch bin bärisch für die Ernte.\n\n\nMittelfristig bullisch mit einigen Dutzend Aktien.\nWer trotzdem morgen zocken will:\n\nPuts mit 340$ 320$ Strike preis.\nUnd dann nach dem Dip Anrufe für Ende des Jahres auf 380$ bzw 400$ kaufen.\nGrüße an die Safari Bande.\nDisclaimer: keine Anlegergebratung",
        "date": 1739388495.0
    },
    {
        "title": "Jetzt Rheiner short fetzen - Trump redet mit Putin",
        "text": "https://preview.redd.it/rnlxb49z1rie1.jpg?width=935&format=pjpg&auto=webp&s=135070cc8860c80e398f88896221bb004e2c0e62\n\nJetzt Rheinmetall Short ballern? Morgen in der früh gehts doch da safe bergab, oder was ist eure hochqualitative Analyse?  \nHabe kurz den Chart betrachtet, die Überschrift gelesen und habe folgende direkte Empfehlung: SHORT",
        "date": 1739384181.0
    },
    {
        "title": "Tschüss",
        "text": "Nachdem ich jetzt in den letzten drei Monaten knapp 10.000 Verlust machen musste, ist es an der Zeit adieu zu sagen. Ich komme wieder keine Sorge.\n\nDHL Long liegt im Depot knock-out bei 27 €. Wenn die bei 45 sind, bin ich auf null Baby. Bis dahin hört dir nichts mehr von mir. \n\nHab euch lieb, ich deinstalliere den Scheiß hier und die /Finanzen Wichser können sich ficken gehen. ",
        "date": 1739310288.0
    },
    {
        "title": "Google says commercial quantum computing applications arriving within five years",
        "text": "",
        "date": 1739342274.0
    },
    {
        "title": "Tägliche Diskussion - February 12, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1739329252.0
    },
    {
        "title": "Am hochpumpen",
        "text": "Gerade beim Plasmaspenden dieses Teil zum pumpen erhalten. Ich pump Blut und Bulle pumpt Börse hoch !! ",
        "date": 1739283147.0
    },
    {
        "title": "Porsche sucht dich als Trader",
        "text": "Gerade auf Jobsuche? Warum nicht bei der Porsche AG? Locker-flockig mal 20 Mrd Euro verhebeln? Da kommt doch bestimmt Stimmung in der Bude!\n\n[https:\\/\\/jobs.porsche.com\\/index.php?ac=jobad&id=7727](https://preview.redd.it/05hpkwf9zgie1.png?width=854&format=png&auto=webp&s=9e4adddfaff60dc409f0c74cf9548954f6de8632)",
        "date": 1739262211.0
    },
    {
        "title": "Eure Top 3 Hebel für die Woche?🐭🫂🐕",
        "text": "\nNachdem mir Nvidia heute mein hart erhebeltes Geld halbiert hat 🦍wollte ich mich mal bei den Profis informieren und nachfragen wo man den Rachehebel diese Woche ansetzen könnte.\nOder wird ein Rachehebel stets auf den selben Basiswert gesetzt? \n\nLiebe Grüße ",
        "date": 1739298517.0
    },
    {
        "title": "TUI-Moon-Mission: Urlaub machen für Tendies?",
        "text": "Okay Leute, ich hab da so einen absolut seriösen Gedanken, der rein hypothetisch ist und natürlich keine finanzielle Beratung darstellt.\n\nStellt euch vor, wir hätten eine Aktie – sagen wir mal rein zufällig TUI. Und stellt euch weiter vor, wir würden einfach alle mal Urlaub machen. Nur aus Gründen. Nicht, weil wir irgendwas mit der Aktie machen wollen, sondern weil Urlaub einfach geil ist.\n\nWas könnte passieren?\n\n\t•\tTUI freut sich über mehr Umsatz, und die Quartalszahlen könnten vielleicht (rein spekulativ gesprochen) besser aussehen.\n\n\t•\tWir hätten alle eine entspannte Zeit am Strand, während unser Depot sich vielleicht auch entspannt.\n\n\t•\tVielleicht merken auch andere Leute, dass Urlaub gar keine so schlechte Idee ist, und buchen mit.\n\nNatürlich gibt es Risiken:\n\n\t•\tVielleicht reicht unsere kollektive Reiselust nicht, um TUI nennenswert zu beeinflussen.\n\n\t•\tVielleicht wird unser einziges Plus die Sonnenbräune.\n\n\t•\tVielleicht ist das einfach eine schlechte Idee, aber wenigstens eine, die sich besser anfühlt als irgendeinen Hebel auf eine Tech-Bude zu werfen.\n\nRein hypothetisch gefragt: Wenn man eine Aktie hätte, bei der Konsum das Geschäft direkt beeinflusst – wäre das dann nicht die vielleicht",
        "date": 1739292640.0
    },
    {
        "title": "Europol: Finanzinstitute sollten rasch auf quantensichere Kryptografie umsatteln",
        "text": "",
        "date": 1739255491.0
    },
    {
        "title": "Dein Portfolio ist abgestürzt? Mach dein Hobby zum Beruf!",
        "text": "",
        "date": 1739196273.0
    },
    {
        "title": "Tägliche Diskussion - February 11, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1739242862.0
    },
    {
        "title": "Einmal Faktor aktualisieren bitte",
        "text": "Jetzt eine starke Woche bitte. \n\n",
        "date": 1739203058.0
    },
    {
        "title": "Brüder und Schwestern, wir haben es ins Jules Video geschafft!",
        "text": "",
        "date": 1739106268.0
    },
    {
        "title": "Tägliche Diskussion - February 10, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1739156474.0
    },
    {
        "title": "\"Mama, wir sind in den Nachrichten!\"",
        "text": "Leider steht in dem Artikel nicht drin, wie groß der Schwanz wird, wenn man erstmal anfängt sich geil einen reinzuhebeln...typisch..\n",
        "date": 1739127888.0
    },
    {
        "title": "Wer kann die deutschen Finanz-Unters noch retten?",
        "text": "",
        "date": 1739105187.0
    },
    {
        "title": "Mit donnerndem Applaus",
        "text": "",
        "date": 1739096764.0
    },
    {
        "title": "Pov: Du performst MSW aus.",
        "text": "",
        "date": 1739054487.0
    },
    {
        "title": "Implizite Bewegung vs. Durchschnittliche Vergangenheitsbewegung für diese Woche Veröffentlichungen von Unternehmensergebnissen",
        "text": "",
        "date": 1739114661.0
    },
    {
        "title": "Der Schlachtplan für die kommende Woche:",
        "text": "Nochmal lass ich mich nicht von dem orangenen Gichtkopf in der Pfeife rauchen! ",
        "date": 1739029655.0
    },
    {
        "title": "freitag diese Woche. wäre diese Mittelfingerkurve nicht gewesen wäre ich noch drinne.",
        "text": "",
        "date": 1739057025.0
    },
    {
        "title": "Dies ist in Ordnung",
        "text": "",
        "date": 1739016696.0
    },
    {
        "title": "Hebelschwester Hildegard",
        "text": "Hildegard, setzt richtig schönen Rentenhebel! Hat sie auch Recht, lieber verzocken, als es der Jugend zu überlassen! Sei nicht dumm, sei wie Hildegard!\n\nhttps://www.instagram.com/reel/DFzcaakI_8K/?igsh=dXc4OW1laG1nMHlu",
        "date": 1739007859.0
    },
    {
        "title": "🚀🚀🚀Lasst das System endlich für uns nutzen🚀🚀🚀",
        "text": "Tach Zusammen,\n\nNach der ganzen Fickerei durch den 🍊Mann und welche Dullis auch immer und wir alle Geld ohne Punkt und Komma in den Sand setzen, was im innersten vermutlich mal jedem auf den Piss geht, hab ich jetzt die ultimative Idee, wie wir endlich Geld verdienen können🚀🚀🚀\n\nWir machen unseren eignen MSW Fonds auf🚀 u/monchella420 als Manager weil der halt einfach der geilste ist 🚀\n\nDann pumpen wir jedes mal, wenn wir denken eine so grandiose Idee haben, die nur grün werden kann und nach Exekution der Klopfaus und ganz zufällig wie noch nie zuvor unser Geld flöten ist, das Geld in den Fonds rein.🚀 Dann machen wir irgendwann im Jahr keine Ahnung, kann man ja gucken, eine Abstimmung wo wir rein gehen. Dann pumpt Monchi das ganze Geld in irgend n Pfennigstock oder nu sonstige Bumsbude rein, die steigt, wir locken andere Männis an die uns Ausstiegsflüssigkeit geben und dann sind wir alle reich🚀🚀 \n\nDas doch ein super Plan🚀 damit fliegen wir zur Sonne",
        "date": 1738951103.0
    },
    {
        "title": "Alles mutig draufsetzen",
        "text": "\nIch will meine Verluste von Intel zurück, wünscht mir Glück",
        "date": 1738942167.0
    },
    {
        "title": "Wochenendschnack vom February 07, 2025",
        "text": "Hoch die Hände - Wochenende! \n\nHier könnt ihr die vergangene Börsenwoche genüsslich sezieren, euch gegenseitig auf die Schulter klopfen (oder trösten) und über den nächsten Hebel nachdenken. Was steht auf eurer Watchlist? 🚀\n\n⚠️ Die Regeln gelten hier natürlich wie immer, aber die Hurensohnmods drücken ein Auge zu, wenn ihr mal ein bisschen über den Tellerrand des Subs schaut. \n\n**🎧 Für die Ohren gibt's hier was Feines:[Podcast & Musik](https://distrokid.com/hyperfollow/monchella420/). Damit tradet es sich gleich doppelt so smooth.**",
        "date": 1738962045.0
    },
    {
        "title": "Nächste Woche Gewinnveröffentlichungen nach implizierter Bewegung",
        "text": "",
        "date": 1738956108.0
    },
    {
        "title": "Palantir",
        "text": "",
        "date": 1738864300.0
    },
    {
        "title": "Tägliche Diskussion - February 07, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1738897280.0
    },
    {
        "title": "Affen zusammen stark: Suche Experten in Luxemburgischen Squeze Out Recht um nicht von Oligarch gefickt zu werden",
        "text": "So, ihr Autisten und Affen, ich brauche eure gesammelte \"Weisheit\", um eine Idee zu bekommen, was ich am besten mache, damit ich mit meinem **Kernel Holding**\\-Investment nicht komplett verarscht werde.\n\n**Kurzer Überblick:**  \nIch habe zu Beginn des Krieges in **Kernel Holding** investiert, einen ukrainischen Hersteller von Sonnenblumensamen, weil mir die gottlos unterbewertet erschienen. Von der geschäftlichen Seite her ist das Ganze voll aufgegangen – die verdienen mehr Geld als vor dem Krieg und haben trotz einer absolut absurden Kapitalerhöhung (dazu später mehr) aktuell ein KGV von 5 und einen Buchwert, der über dem aktuellen Aktienkurs liegt.\n\nSoweit, so gut. Einziges Problem: Ein größerer Fisch im Teich, **Andrii Verevskyi**, der Oligarch, der **Kernel** gegründet hat, sah das genauso und hat beschlossen, mit allen legalen und halb bis illegalen Mitteln die Aktien zurückzukaufen. Begonnen hat es mit einem normalen Rückkauf, einem lächerlich niedrigen Rückkaufangebot und schließlich einer Kapitalerhöhung, welche die Aktienanzahl verdreifacht hat – zu einem Preis, der bei ungefähr 15 % des damaligen Kurses lag, unter Bedingungen, dass eigentlich nur er welche kaufen konnte :-). Die Firma wird jetzt in fünf Anklagen wegen dieses Vorgehens von Minderheitsaktionären verklagt.\n\n**Nun zum aktuellen Problem:**  \nDer Sonnenblumkernscheißer hat jetzt die **95 %-Grenze** überschritten und kann somit einen **Squeeze-out** durchführen. Da ich kein Experte im luxemburgischen M&A-Recht bin und meine studentische Positionsgröße (2k) keinen Anwalt zulässt, wäre ich dankbar für jegliche Hinweise und Ideen aus der Affenmasse.\n\nDa selbst der Buchwert **50 % über meinem Einstiegskurs** liegt, mache ich mir keine Sorgen, hier mit Minus rauszugehen. Aber für den ganzen Struggle und die Nerven hätte ich doch gerne das Maximum rausgeholt – und das Unternehmen ist auch klar mehr wert.\n\nVielen Dank für eure Hilfe, und wenn ihr nicht helfen könnt hoffe ich das euch diese gigantische Fickerei wenigstens unterhält. ",
        "date": 1738857959.0
    },
    {
        "title": "Hebelroulette - Das Spiel",
        "text": "Guten Tag gegenwärtige und zukünftige Millionäre.\n\nMir ist eine SUPER Idee für ein Spiel eingefallen.\n\nHebelroulette - Macht deine dünnen Scheine fett!\n\nRegeln:\n\nDas Roulette ist in 3 verschiedene Schritte aufgebaut.\n\nSchritt 1: Roulette- Drehung zur Auswahl des zukünftigen Kaufs.\n\nSchritt 2: Roulette- Drehung zur Auswahl und Höhe des Hebels\n\nSchritt 3: Roulette- Drehung zum Zeitpunkt des Verkaufs.\n\nDiese Auswahlmöglichkeiten werden von der Community vorgeschlagen und zufällig Live ausgelost.\n\nSämtliche Belege für Kauf/ Verkaud etc werden veröffentlicht.\n\nDies soll erstmal ein kleiner Testlauf sein um zu gucken wie ihr auf rote Bilder reagieren würdet.\n\nP.S.: Das Spiel würde doppelt soviel Spaß machen weil ich KEINE AHNUNG von Hebeln habe. \n\nHättet ihr Bock drauf?",
        "date": 1738863924.0
    },
    {
        "title": "Flieg mein großer! Flieg! 🚀🚀",
        "text": "",
        "date": 1738848708.0
    },
    {
        "title": "KI Butzen WTF? 🚀💥",
        "text": "\n\nHallo zusammen, \n\nWie einige hier verbringe auch ich 90% meines Lebens auf meinem Brecher, um ganz genau verfolgen zu können wie mein Geld weniger wird. \nSeit einiger Zeit ist mir aufgefallen, dass so kleine KI Stöcker wie BigBear.ai und D-Wave Quantum täglich teilweise sich 30% 🚀🚀🚀oder ähnlich bewegen. Sowohl nach oben, als auch nach unten. \nDie Marktkapitalisierungen der beiden sind jetzt nicht unterirdisch aber auch nicht gigantisch. Zwischen 1 und 2 Milliarden.\n\nSind das zwei Stöcker die einfach random von so Heinis wie uns die ganze Zeit hin und her gepumpt werden oder gibt es irgendeinen halbwegs trivialen fundamentalen Grund, weshalb die sich ebenso bewegen?\n\n\n\n",
        "date": 1738841393.0
    },
    {
        "title": "der war gut",
        "text": "",
        "date": 1738797487.0
    },
    {
        "title": "Es ist so weit, der Heilige Amumbo hat es als erster gehebelter ETF in der EU geschafft die 1 Milliarde Euro Fondsvolumen zu erreichen! 🎉",
        "text": "",
        "date": 1738780806.0
    },
    {
        "title": "Tägliche Diskussion - February 06, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1738810856.0
    },
    {
        "title": "#136 NVIDIA, DeepSeek und das beste aus der Woche",
        "text": "Liebe Freunde,\n\ndiese Woche mit den lahmen Enten und es wurde natürlich sehr gut!\n\n🎤 Hört euch die Folge an und lasst uns ein wenig Liebe da 🎤\n\n# Wie immer [überall](https://distrokid.com/hyperfollow/monchella420/)\n\n* [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe?si=bdd272c0b6024666)\n* [Apple](https://podcasts.apple.com/de/podcast/mauerstrassenwetten-podcast/id1572657389)\n* [Youtube](https://www.youtube.com/@monchella420?sub_confirmation=1)\n\n**In ewiger Liebe 🥺❤️**\n\nEuer MSW Podcast Team",
        "date": 1738812018.0
    },
    {
        "title": "AMD 30K Lang",
        "text": "Nachdem ich 4000 Euro über Nacht an die 🏳️‍🌈🐻 verloren habe, hole ich mir jetzt mit Rachehebel alles zurück! AMD sei mein Advanced Money Destroyer! 😅🔥",
        "date": 1738785519.0
    },
    {
        "title": "Aurora gönnt Dröhnung!",
        "text": "Ich fühle mich fast ein bisschen bekifft.. das war ein wirklich geiles Ernte-Dank-Fest! \n\n913,49 -> 7165 $ (realisierter Gewinn)\n\n",
        "date": 1738784739.0
    },
    {
        "title": "ALLE (!!) Trading Apps holen um Neukundenboni zu ergaunern. Was kann schon schiefgehen?",
        "text": "Viele Trading Apps und Neobroker werben neue Kunden mit tollen Angeboten. Hier gibts ne Gratis Aktie fürn Anfang, da paar Prozent Cashback für die ersten Monate und nochmal woanders gibts ein kleines Startguthaben nach der ersten Einzahlung.\n\nMeine Idee war nun mir haufenweise dieser Apps zu holen, die Mindestbedingungen zu erfüllen, dann alles zu verkaufen und die App zu löschen. Der Exit Scan des kleinen Mannes quasi. Keine großen Summen aber ein paar hundert Euro sollten drin sein wenn alles gut läuft.\n\nGibt es etwas was ich dabei nicht bedacht habe? Irgendwelche versteckten Hintertürchen, ein auffressen des Gewinnes über den Spread oder ähnliches?\n\nHier noch ein Beispiel was ich damit meine:  \n[https://rankia.de/broker-mit-startguthaben-vergleich/](https://rankia.de/broker-mit-startguthaben-vergleich/)",
        "date": 1738721126.0
    },
    {
        "title": "Tägliche Diskussion - February 05, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1738724463.0
    },
    {
        "title": "Danke an die PLTR Ernte",
        "text": "",
        "date": 1738689457.0
    },
    {
        "title": "Wie ich um 15:30 ins Depo schau: Bereit für den amerikanischen Angriff 🫡",
        "text": "Hoffentlich kann Novo Nordisk die Stellung halten 🗿",
        "date": 1738592038.0
    },
    {
        "title": "Der Grund warum ich auf weiteres in r/ameisenstrassenwetten bleiben werde",
        "text": "",
        "date": 1738616537.0
    },
    {
        "title": "mit 15 Jahren anonym BTC gekauft, möchte jetzt verkaufen",
        "text": "Abend, ich habe kurz vor meinem 16er angefangen jegliches Taschengeld in Bitcoin zu buttern. Danach ab und an nachgekauft und jetzt seit Jahren nichts mehr gemacht. Es sind jetzt etwas über 13 btc. Ich glaube erstmal nicht an einen großen Kursanstieg und plane den Großteil zu verkaufen. Es gibt nur ein Problem: Ich habe alle Bitcoins anonym gekauft, war noch nie auf einer Börse registriert. Wie erkläre ich das Behörden/Banken? Ich denke mal bei nem anfang 20 Jährigen mit auf einmal 1,3m auf dem Konto werden die etwas stutzig.\n\nIch bin kein Experte, fand Bitcoin damals einfach nur interessant.",
        "date": 1738609873.0
    },
    {
        "title": "Was macht ihr eigentlich da drüben?",
        "text": "",
        "date": 1738614685.0
    },
    {
        "title": "Short auf die Fetten",
        "text": "Freitag 16:00 gekauft, anfangs ein 250x Hebel",
        "date": 1738595975.0
    },
    {
        "title": "Tägliche Diskussion - February 04, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1738638062.0
    },
    {
        "title": "Alternative zu MarketScreener? 🕵🏻‍♂️🧞‍♂️",
        "text": "\nHallo zusammen,\n\nkennt jemand eine gute Plattform, auf der man Forecasts für die drei Finanzberichte (Income Statement, Balance Sheet, Cash Flow Statement) findet? Idealerweise umsonst und auch als Download.\n\nMir ist aufgefallen, dass die Daten bei MarketScreener teils veraltet sind, was richtig Fik ist. \n\nFalls jemand einen Geheimtipp hat, würde ich mich sehr freuen!\n\nDanke euch! 🫶",
        "date": 1738668198.0
    },
    {
        "title": "Knocki Knocki Knock",
        "text": "",
        "date": 1738589095.0
    },
    {
        "title": "Meinungen?",
        "text": "",
        "date": 1738610820.0
    },
    {
        "title": "15:30: Donald Pump oder Donald Dump?",
        "text": "",
        "date": 1738583881.0
    },
    {
        "title": "Es ist jetzt ein Po-folio (mal wieder)",
        "text": "",
        "date": 1738580509.0
    },
    {
        "title": "Heute dicke Rabatte",
        "text": "",
        "date": 1738566510.0
    },
    {
        "title": "Derivate Handels und Öffnungszeiten",
        "text": "Hallo,\nbevor der Thread geschlossen wird.\nDer Handel zB bei trade Republic läuft ja via HSBC zwischen 8 und 22 Uhr.\nJe nach Aussteller, ansässige Börse der Basisaktie, Uhrzeit usw. hat es einen Einfluss auf den spread.\n\nZum Beispiel Siemens Energy. Derivate sind nach 2030 10x höher im spread - obwohl Deutschland als Handelsplatz und HSBC als Derivatedealer.\nWarum habe ich bei der plötzlich statt 5 Cent spread plötzlich 50 cent? Alle üblichen Faktoren sind meines Wissens nach ok.\n\nGibt es irgendwo eine detaillierte Auflistung? In Google sind nur die üblichen Uhrzeiten und Aussteller genannt...",
        "date": 1738614462.0
    },
    {
        "title": "Schönen Sonntag euch allen",
        "text": "",
        "date": 1738508843.0
    },
    {
        "title": "Tägliche Diskussion - February 03, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1738551677.0
    },
    {
        "title": "Update 1/12: Von 0 zu 1 Millionen Euro in einem Jahr Challenge",
        "text": "Hallo liebe Community.\n\nEntschuldigt die etwas verspätete Antwort.\n\nErst einmal wünsche ich euch ein erfolgreiches und vor allem frohes neues Jahr.\n\n\n\nIch möchte mich an dieser Stelle bei euch für die enorme Interaktion unter meinem Post letzten Monat bedanken. Der Beitrag hat stolze 754.000 Aufrufe erzielt – unfassbar.\n\nDoch kommen wir zum Punkt.\n\n\n\nEs ist nur ein Monat vergangen, aber es hat sich in Bezug auf mein Leben und somit auch auf dieses Vorhaben viel getan. Ich werde nicht auf persönliche Details eingehen, da ich denke, dass sie für euch nicht wirklich interessant sind. Aber sagen wir es mal so: In diesem Monat ist privat so viel passiert, wie normalerweise in einem halben Jahr.\n\n Außerdem ist in der Welt so viel passiert – es ist verrückt. Vor allem – und das habt ihr sicherlich fast alle mitbekommen – hat sich unglaublich viel in der KI-Industrie getan. Gerade die Veröffentlichung von Deepseek hat die Tech-Welt regelrecht zum Beben gebracht. Eine Billion Dollar pulverisiert. Und das an einem Tag. Historisch.\n\n**Nvidia erlitt den größten Verlust, den ein börsennotiertes Unternehmen jemals an einem einzigen Handelstag verzeichnet hat.**\n\n\n\nNun sieht die Welt der Möglichkeiten um vieles anders aus als noch vor 31 Tagen.\n\nUm nicht zu viel um den heißen Brei herumzureden und um euch bei meinem Vorhaben wie versprochen klar und vor allem transparent monatlich auf dem Laufenden zu halten, sage ich es euch direkt und schmerzlos:\n\n  \n\n\n**Das Projekt wird durchgezogen.**\n\n**Aber es wird ein “Fokus-Pivot” durchgeführt.**\n\n  \n\n\nDie Definition per ChatGPT lautet:\n\nDabei wird ein Geschäftsmodell, das ursprünglich mehrere Bereiche oder Geschäftsfelder umfasste, auf den vielversprechendsten oder überlebensfähigsten Bereich reduziert.\n\nMerkmale eines Fokus-Pivots:\n\n• Die Marktlage ändert sich plötzlich (z. B. Wirtschaftskrise, regulatorische Änderungen, neue Technologien). **Trifft zu.**\n\n• Ein Bereich des Geschäftsmodells wird unrentabel, nicht skalierbar oder obsolet. **Trifft teilweise zu**\n\n• Das Unternehmen entscheidet sich, seine Ressourcen nur noch auf das erfolgversprechendste Segment zu konzentrieren. – **Trifft absolut zu**\n\n• Oft geschieht dies unter Zeitdruck, um das Überleben des Unternehmens zu sichern. – **Trifft nicht zu**\n\n\n\nIch habe mich dazu entschieden, mich vor allem auf den zweiten Punkt des Vorhabens zu fokussieren – also die Erstellung von Software durch KI-gestützte Sprachmodelle.\n\n\n\nDas bedeutet nicht, dass ich das TikTok-Vorhaben nicht anpacke. Ich werde lediglich die zeitlich angedachten Ressourcen umstrukturieren, da es zwar immer noch ein unglaublich rentables Modell ist, ich jedoch bei der Erstellung von KI-Software aktuell  mit Abstand das größte Potenzial sehe.\n\n\n\nEs ist ein regelrechter Wilder Westen da draußen.\n\nAlles ist optimierbar und damit auch in den allermeisten Fällen automatisierbar. Ich habe im Januar bestimmt 100 Stunden damit verbracht, in sozialen Netzwerken, Foren, auf anderen Websites mir einen Überblick zu verschaffen. Nicht so leicht, wenn jeden Tag ein neuer Durchbruch verkündet wird.\n\n**Macht euch auf OpenAIs neue Software bereit, die in den nächsten Tagen verkündet wird.**\n\nFür mich galt schon immer bei einem Vorhaben als oberste Priorität, mir initial ein festes Grundwissen/Fundament aufzubauen, bevor ich mich in eine Angelegenheit stürze.\n\n\n\nVorbereitung und vor allem Vorsicht sind die Impfung gegen unerwartete und vor allem schmerzhafte Hindernisse. Auftreten werden sie aber dennoch – nur ist das Ausmaß ein anderes.\n\n\n\nAlso, genug philosophiert. Was steht jetzt an und wie wird es angepackt?\n\n\n\nSchritt 1: Es wird weiterhin eine Automatisierung vieler TikTok-Kanäle angestrebt. Das größte Hindernis hierbei ist es, 10.000 Abonnenten zu erreichen. Ich habe in meinem ursprünglichen Post von einer monatlichen Erfolgsrate von 10 % gerechnet und muss jetzt sagen, dass ich das für unwahrscheinlich halte. Es sind eher 5 %, da es einfach unfassbar schwer ist, Menschen zum Folgen zu bewegen.\n\n\n\nFür die, die sich für Social Media interessieren: Wenn du herausfindest, wie du Menschen systematisch dazu bringst, Kanälen zu folgen, liegt dir regelrecht die Welt vor den Füßen. Das hat noch niemand ansatzweise auf systematischer Ebene geschafft. Der Einzige, der es vielleicht in diesem Sinne (als Content-Creator) vollbracht hat, ist MrBeast, wenn wir von alleinigen Persönlichkeiten sprechen. Und bei ihm ist es sehr auf den YouTube-Algorithmus ausgelegt. Es gibt einige interessante Videos dazu.\n\n\n\nWie gesagt, TikTok wird durchgezogen. Es ist jetzt nach heutigem Stand – und urteilt gerne erneut über meinen Optimismus (ich verstehe, dass das sehr polarisiert, aber es ist die Wahrheit) – um ein Vielfaches einfacher, TikTok-Kanäle zu automatisieren, als noch vor zwei Monaten. Der Fortschritt in der Informatik ist aktuell ein nie dagewesenes Spektakel.\n\nDer größte Goldrausch seit Menschengedenken.\n\n\n\nSchritt 2: Alles bleibt gleich, nur dass ich dort mehr Zeit investieren werde, als ursprünglich antizipiert. Ich habe ursprünglich damit gerechnet, dass ich erst 3–4 Monate ausschließlich mit der Automatisierung der TikTok-Kanäle beschäftigt sein werde, was jetzt wahrscheinlich 1–2 Monate dauern wird. Ich werde hier aber nicht auf technische Details eingehen, bis ich sie umgesetzt habe. Viel reden kann nämlich jeder. \n\nIch bin sehr gerne bereit dazu, meine Vorgehensweisen dann in Zukunft mit euch zu teilen, auch wenn ich die genauen Aspekte nicht preisgeben werde. Das kann ich nämlich auch gar nicht, da Kreativität nun mal nicht teilbar ist.\n\n\n\nDas heißt, dass sich der Großteil des Projekts auf die Erstellung von AI-Wrappern und AI-Agents fokussieren wird. Hierbei seien zwei Sachen angemerkt:\n\n1. Viele haben mich privat angeschrieben und gefragt, was denn dies oder das zu bedeuten hat. Das ist natürlich gar kein Problem, aber ich komme da leider kaum hinterher. In den Kommentaren gab es auch viele Fragen. Es gibt wirklich sehr viele Informationen dazu auf YouTube und im Web allgemein. Wenn ihr täglich “frischen” Content zu den Themen KI, Automatisierung und Zukunftstechnologien allgemein sehen wollt, dann ist die Plattform X die beste Anlaufstelle. Ich kann nachvollziehen, dass einige abgeneigt gegenüber X sind, aber es ist nun mal der Hotspot dieser Community und der Algorithmus baut euch einen Feed, der sehr personalisiert ist.\n\n2. Mein Fokus wird vor allem darauf bestehen, einen Exit zu schaffen. Dies bedeutet, eine Software vollständig an eine Firma zu verkaufen. Dies ist nach “Startup-Business-Logik” der schnellste bzw. der Weg mit den wenigsten Schritten, um die Menge an Kapital zu erreichen, die ich anstrebe.\n\n\n\nIch möchte noch einmal auf eure Kommentare eingehen:\n\nMir ist durchaus bewusst, dass ich einen teilweise leichtsinnigen oder gar schon frechen Eindruck hinterlasse, da sich dieses Vorhaben vermutlich für die meisten von euch unrealistisch anhört. Aber ich meine es absolut ernst.\n\nJedoch begrüße ich eure Interaktionen mit meinen Inhalten auf jeder Ebene, denn ein Mensch ist nie frei von Fehlern und vielleicht bin ich einfach nur ein missratener eingebildeter Student.\n\n\n\nAber ich tue alles im guten Gewissen und mit ausschließlich guten Intentionen.\n\nDanke für eure Aufmerksamkeit.\n\n\n\n\n\n**Anmerkungen:**\n\n1. Ich habe einmal einen Post auf einem Subreddit gemacht (schaut gerne nach, es ist alles öffentlich), in dem ich behauptet habe, dass ich ein paar Nischen gefunden habe, was Inhalte angeht. \n\nDavon bin ich weiterhin überzeugt. \n\nLeider hatte ich damals aufgrund meines Studiums nicht die Zeit, die Sache anzupacken. Den Post habe ich noch nicht aktualisiert, werde das aber noch tun.\n\n2. Jemand hat im Original-Beitrag vorgeschlagen, dass ich meinen gesamten Umsatz spenden soll, wenn ich die angestrebten 1 Million Euro Netto-Umsatz nicht erreiche. Ich habe zugestimmt.\n\n\n\nDavon werde ich nicht vollständig zurücktreten, da ich diese Idee unterstütze und sehr gerne spende bzw. teile. Leider befindet sich meine Familie aktuell in einer ziemlich starken Finanzkrise (dazu habe ich bereits vor Monaten einen Post gemacht, auch alles transparent einsehbar), und ich würde zunächst sämtliche Schulden abbezahlen und meiner Familie aus der Notlage helfen, bevor ich spende. Der Deal bleibt davon abgesehen unberührt. Ich hoffe auf euer Verständnis.\n\n\n\nDie nächsten Updates werden möglicherweise nicht so lang und ausführlich, aber ich gebe mir Mühe, von allen Dingen zu erzählen, die relevant sind.",
        "date": 1738625080.0
    },
    {
        "title": "Tariffs? Flucht in Safe Haven Asset long $UUP",
        "text": "Wollte eigentlich in WSB posten aber somehow my posts are perpetually deleted also hoffe das geht hier klar:  \n  \nAlright degenerates, listen up. We're in uncharted waters with Canada slapping 25% tariffs on $115 billion of US goods, but if history’s any guide, our safe-haven play on the U.S. dollar is rock solid. When trade wars ramp up, uncertainty goes through the roof—and that’s exactly when global investors scramble for safety.\n\n**Remember the U.S.-China trade war?**  \nDespite the steep tariffs and wild rhetoric, investors piled into the dollar and Treasuries like it was a Black Friday sale. Crisis periods have repeatedly shown that when shit hits the fan, the dollar stands as the last bastion of stability. The US remains the world’s most liquid and stable economy, so when panic sets in, capital flows into it like bees to honey.\n\nThis isn’t just academic—this trade simply can’t go tits up in the sho\\*t term. With Nasdaq futures tanking and the risk-off mode in full swing, a sh\\*rt-term UUP call (think one week) is primed for a rally. Even though we might have overbought at a slightly higher premium, the immediate flight-to-safety will likely push UUP higher if uncertainty persists. And sure, if the economic fundamentals take a hit and the Fed starts talking dovish, the long-term picture might shift—but we’re playing for quick gains here.\n\nOn the flip side, manufacturing is getting hammered by these tariffs. Industries that rely on cross-border trade are about to feel it, so puts on manufacturing for a 2-4 week horizon make total sense. The safe haven reaction in the sh\\*rt term for the dollar and the pressure on industrials aren’t mutually exclusive; they’re two sides of the same coin in this trade war mess.\n\nSo, when you stack this all up: with the historical context of past trade wars and crisis periods, we’re looking at a near-term rally in UUP that’s almost a sure thing. The risk-off sentiment is undeniable, and if you’re riding the U.S. dollar wave right now, this trade simply can’t go tits up. Keep your eyes on UUP, monitor the market for any shifts, and tighten those stops if necessary. This is the play, and it’s backed by both history and the raw market sentiment we’re seeing today.\n\n**Position: $UUP 01/21 $30 Calls**",
        "date": 1738594451.0
    },
    {
        "title": "Warum ich in $ASML investiert bin",
        "text": "Hier ein interessanter Thread (mit Eigenwerbung des Erstellers) auf X dazu, mit Informationen zu computational lithography, dem dahinter liegenden Prozess, der benötigten Hardware und den Alleinstellungsmerkmalen von $ASML. Moderne KI, NVIDIA, TSMC, Apple und viele mehr wären ohne ASML nicht denkbar. Andersherum heißt das aber auch, dass ASML von den großen Techfirmen abhängig ist. Wenn der Techboom nachlässt, wirkt sich das auch auf ASML aus. Das sehe ich aktuell aber nicht, selbst mit den neuen (angeblich) effizienteren Trainingsansätzen von DeepSeek et al.\n\n(Das ist natürlich keine Anlageberatung)\n\n[https://x.com/MMMTwealth/status/1885673732770775440](https://x.com/MMMTwealth/status/1885673732770775440)\n\nhttps://preview.redd.it/in423f9uhpge1.png?width=680&format=png&auto=webp&s=6508050cdcc271e52ba5c0b396fc78e4b427bcd2\n\n[](https://preview.redd.it/hier-ein-paar-gr%C3%BCnde-warum-ich-ziemlich-tief-in-asml-v0-0pksubrwepge1.png?width=680&format=png&auto=webp&s=15c94e65b1149683c87d7ac24d23d735b5fa3442)",
        "date": 1738493603.0
    },
    {
        "title": "Implizite Bewegung vs. Durchschnittliche Vergangenheitsbewegung für diese Woche Veröffentlichungen von Unternehmensergebnissen",
        "text": "",
        "date": 1738503746.0
    },
    {
        "title": "Amumbo als Inflations Hecke",
        "text": "Ich weiß, der Amumbo hat hier eigentlich nichts verloren, aber hört mich raus:\n\nIch denke er könnte mit seinem konservativen 2x Hebel und der vergleichsweisen breiten Streuung gut als Hecke gegen die Inflation dienen.\n\nDenn.. angenommen die Inflation ist 2% und der Markt kommt dem nach und wächst seine üblichen 7-10% im Jahr INFLATIONSBEREINIGT... \n\nDann ist das nominale Wachstum 9-12 %, durch den Hebel landen wir aber bei 18-24 %, obwohl nur 2 % Inflation waren! Das macht die reale Rendite mit 16-22 % nochmal saftiger. Denn die Inflation wird ja nicht 2x gehebelt!\n\nKEINE ANLAGEBERATUNG!!!!!!!",
        "date": 1738474650.0
    },
    {
        "title": "Vielleicht ein Paralleluniversum?",
        "text": "",
        "date": 1738442901.0
    },
    {
        "title": "Krise kann auch geil sein",
        "text": "",
        "date": 1738435865.0
    },
    {
        "title": "Morgen NVIDIA SHORT",
        "text": "Alibaba hat Qwen 2.5 Max rausgebracht. Es soll wohl besser als Deepseek, OpenAI oder Google sein.\nWir haben ja schon bei deepseek‘s Veröffentlichung gesehen, wie die Börse darauf reagiert hat, schauen wir mal wie sie morgen auf diese Nachricht reagiert ",
        "date": 1738506468.0
    },
    {
        "title": "Wer von euch ist das?",
        "text": "",
        "date": 1738416842.0
    },
    {
        "title": "DD Dollar General der volatilste und erfolgreichste Genral  seit Napoleon",
        "text": "Habt ihr die Schnautze voll immer dem nächsten Trend im Markt hinterher zu rennen und wollt diesen Sommer endlich mal euren Urlaub mit dem Freund eurer Frau geniessen ohne alle 10 Minuten auf eurer Portfolio sehen zu müssen. Dann habe ich eventuell einen antizyklischen Value Titel welchen ihr bis in eurer Verderben halten könnt und euch früher oder später evt. den ein oder anderen Absturz in eurer lokalen Taverne finanziert.\n\n\n\nWollt ihr in Zukunft von finanziell schwachen Fettbürgern und deren irrationalen Konsumverhalten profitieren? Dann könnte der vom Markt in den Boden getretene Dollar General für euch eventuell der Richtige Spielzug sein,\n\n**Wieso?**\n\n**-DG ist ein fundamental äusserst stabiles Unternehmen mit Konsumenten die meist keine andere Wahl haben als beim General einzukaufen**\n\n**-Nach Stagnation von Wachstum in den letzten 4 Quartalen ist die Aktie um über 50% eingebrochen und nun in einem über preisten Markt Spott billig zu haben.**\n\n**-Starker Return auf investiertes Kapital (13%)**\n\n**-Nach meinem Discounted Cashflow Modell ist die Aktie aktuell 35% unterbewertet.**\n\n**-Generiert Shareholdervalue** \n\n\n\n**Was ist Dollar General**\n\nDollar General ist eine Kette von kleinen Retailstores mit Sitz in Tennesee.\n\nDollar General fokussiert sich darauf neue Läden in kleinst Gemeinden oder Stadtteilen von einkommensschwachen Gegenden zu eröffnen. Die nächsten Superstores wie Wallmart Target oder auch grössere Supermärkte wie Trader Joes Kroger und Albertsons sind meist 30 Autominuten oder mehr entfernt. \n\nhttps://preview.redd.it/vtckb0yg9jge1.png?width=1500&format=png&auto=webp&s=2d11ece3c212c7a565946a3e4f790ffe468dc374\n\nDollar General bietet in den meisten Stores keine Frischen Lebensmittel an, da diese höchst verderblich sind.\n\nDie Kette bietet kleine Grössen von Waschmittel Zahnpasta Duschgels Batterie und ähnliches an, dabei werden die kleineren Verpackungen von den grossen und bekannten Firmen wie  Procter and Gamble General Mills, Coca Cola, Monster etc. extra für sie angefertigt. Dies weil die Konsumenten nicht die Grösseren aber pro Anwendungen günstigeren Grosspackungen leisten können die man bei Costco oder Wallmart finden würde. Diese Produkte haben eine wesentlich bessere Marge für Dollar General.\n\nDollar General ist mit 21000 Läden die grösste Ladenkette in den USA und Mexico und in den meisten kleinen Gemeinden nicht mehr wegzudenken und geniessen meist eine Monopol Stellung.\n\nDie Firma least ihre Immobilien und hat nur etwa 6 Mitarbeiter pro Location gegenüber mehr als 200 bei Walmart und Costco. Dies ermöglicht Dollar General viel Flexibilität und günstiges Wachstum weil die Cost of Entry für dessen Bau eines neuen Marktes so niedrig ist.\n\nIn den letzten Quartalen investierte Dollar General primär in renovation der Läden, verbesserte Logistik und ihrem teils neuen Angebot von gekühlten Lebensmitteln. Mit diesem Upgrade erhofft sich Dollargeneral \"Casual Shoppers\" ähnlich wie bei Seveneleven oder Quiktrip zu gewinnen.\n\n  \n**Finanzielle Analyse vom Q3**\n\nDie ökonomische Verlangsamung in den USA macht sich vor allem bei den Einkommens schwachen Konsumenten bemerkbar. So verlangsamte Sich das Wachstum von 9% annualisiert über die letzten 10 Jahre auf nur noch 2.5%. \n\nDollar General schaffte es trotz schwachen same Store Sales Wachstum von 1.3% den Gesamtumsatz durch Expansion auf 5% yoy zu steigern. Die Expansion wurde durch die Eröffnung von 200 neuen Läden vorangetrieben. \n\n2024 wurden 1500 Läden umgebaut und bsi 2025 sollten es weiter 2000 werden. Nach dem Umbau zeigt sich, dass es erheblich weniger Diebstahl gibt, was sich positiv auf die Margin auswirkt,\n\nCEO Todd Vassons Strategie über diese anspruchsvolle Zeit ist \"Back to Basics\" dem Kunden grösseren Value für noch günstigere Preise zu bieten. Während dies potentiell über die nächste Zeit schwächere Margen bedeuten könnte wird dadurch ein Abgang von den wichtigen Kunden und dessen Vertrauen zu einem der Superstores verhindert. Ich erachte dies als die Richtige Strategie um auf lange Zeit erfolgreich zu bleiben und den damit eingehenden Kurseinbruch eine gute Möglichkeit für einen günsigen Preis in ein grossartiges Buisiness einzusteigen.\n\nZudem denke ich das die Vorcovid Entscheidung das gekühlte Lebensmittelgeschäft zu expandieren ein wichtiger Schritt ist selbst eine Superstore Alternative zu werden.\n\nCOGS viel von 71.5 auf 70.2% letztes Quartal eine enorm starke Steigerung!\n\n\n\nhttps://preview.redd.it/3hnx7j5rejge1.png?width=640&format=png&auto=webp&s=89558034f946e2b4fc33225f5f006aabe35e92a9\n\nDollar General benutzt den generierten Cashflow um das Balancesheet und die Logistik und die Effizienz der Märkte zu verbessern\n\nhttps://preview.redd.it/ya9titi1fjge1.png?width=640&format=png&auto=webp&s=d0193f07262cdaca95cc95cd1b44f0f73ca8e39a\n\nDas Inventar viel ebenfalls um 7% auf nur noch 7.1 Milliarden USD was meiner Meinung eine positive Entwicklung gegenüber den Covid-Jahren ist und zeigt das man die Nachfrage besser und Nachhaltiger managed. Ich erachte dies als sehr wichtig vor allem wenn der eigene Konsument eine schwierige finanzielle Phase durchmacht.\n\n \n\nhttps://preview.redd.it/xq1cifshfjge1.png?width=640&format=png&auto=webp&s=033bd8b5801f81c5202fdfbedd7b0ba9d6a659cc\n\nDer Cashflow wurde um massive 46% gegenüber dem Vorjahr gesteigert primär durch Entlastung des Inventars\n\nhttps://preview.redd.it/nfvgqsfsfjge1.png?width=640&format=png&auto=webp&s=846a8bbe94f54966b75d044b8b9bfc2391252655\n\n    Nichtsdestotrotz stiegen die Vertriebs- und Verwaltungskosten im Verhältnis zum Umsatz um 1,2 Prozentpunkte, was zusammen mit den 2,7 Millionen US-Dollar, die das Unternehmen aufgrund der überdurchschnittlich starken Hurrikansaison verkraftete, zu einem Rückgang des Betriebsgewinns um 25,3 % im Jahresvergleich führte.  Dennoch erwirtschaftete das Unternehmen einen Betriebsgewinn von 323,8 Millionen US-Dollar, was in Kombination mit einem Rückgang der Nettozinsaufwendungen um 18 % (hauptsächlich für Leasingverträge) dazu führte, dass der Betriebsgewinn im Jahresvergleich nur um 29 % auf 196,5 Millionen US-Dollar sank.  Der Hauptgrund für diese rückläufigen Erträge ist das relative Wachstum der VVG-Kosten. Ich vermute, dass die erhöhten Investitionen in Personalschulung, Gehälter und Ladensicherheit die Rentabilität der Kette vorerst erheblich verringert haben.  Zu den Vorteilen dieser Investitionen zählen jedoch ein besseres Einkaufserlebnis für die Kunden und letztendlich ein wettbewerbsfähigeres und überzeugenderes Produkt im Discount-Einzelhandelsumfeld                              \n\n[Valuation](https://preview.redd.it/kkj1n0w2gjge1.png?width=936&format=png&auto=webp&s=c22a45dd6b156a5b61cccb6b4c423f4ef1679ac6)\n\n**Valuation**\n\nDer KGV ist mit 11.6 sowohl im Vergleich zum kgv der letzten fünf Jahren als auch im Vergleich zu anderen Unternehmen der Branchen sehr günstig.\n\nDas P/S/ TTM von 0.39x ist brutal niedrig was implizieren könnte das der Umsatz bis zu 61% discounted wird.\n\nDer Unterscheid der Valuation aufgrund des schwächeren Konsumumfeldes ist dafür verantwortlich dass £DG das letzte Jahr massiv unter performte.\n\n[DG Preisentwicklung gegenüber SPY](https://preview.redd.it/f1mgqmd6hjge1.png?width=640&format=png&auto=webp&s=9c92efcc190ba69c6adbbb002f1e02722c7a5930)\n\nIch vermute das damit Mister Market massiv überreagiert und man nun die Aktie für einen sehr günstigen Preis kaufen kann. Deshalb habe ich ein Discounted Cashflow Modell gebaut um alle Umsätze und Cash gegenüber dem aktuellen Aktienkurs mit einem Discount auszurechnen.\n\nDas durchschnittliche Wachstum der letzten zehn Jahre von 15.45% habe ich dabei auf bloss 10% reduziert um das ganze etwas realistischer gegenüber dem aktuellen Umfeld zu gestalten.\n\nDie Terminal growthrate von knapp 3% sollte in etwa in Line mit der Inflation in der USA liegen. Ich habe eine Abpreisung von 8% gegenüber des S&P 500 verwendet aufgrund der Historischen Returns der letzten 20 Jahren. \n\nhttps://preview.redd.it/db2kk82gijge1.png?width=640&format=png&auto=webp&s=9378a9e5661866b1254e488e3de88c0c3ad153b0\n\nMit diesen Inputs komme ich auf ein Fair Value von 102.93 diese liegt 31.90 USD höher als des letzte Closing (31.01.2025)\n\nIn den nächsten 3-12 Monaten vermute ich dass es weiters negatives Sentiment und eventuell eine kliene Margine Verschlechterung geben wird. Also kauft bitte weder Knockout Zertifikate der HSBC noch Leaps sondern nach und nach in kleinen Orders Stöcker fals ihr euch zu einem Kauf entscheiden solltet.\n\nIn den nächsten 1-10 Jahren jedoch sehe ich die Entwicklung von DG  als positiv und denke durch den starken Cashflow welchen sie generieren und bis auf ein 30% Dividenden Payout weiterinvestieren werden sie weiterhin stark expandieren und wachsen können, was sich auch auf den Aktienpreis auswirken wird.\n\n\n\nDies ist keine Anlageberatung ihr kleinen Ficker!",
        "date": 1738422790.0
    },
    {
        "title": "AVDL Avadel Pharmaceuticals - schnelle DD",
        "text": "**Fazit vorweg:  Stark Bullenhaft** \n\n**Aktienkursentwicklung und gleitende Durchschnitte:**\n\n31. Januar 2025 notiert die Aktie von AVDL bei 7,90 $. Der gleitende 50-Tage-Durchschnitt liegt bei etwa 9,86 $ und der gleitende 200-Tage-Durchschnitt bei etwa 13,89 $. Der aktuelle Kurs liegt unter beiden Durchschnittswerten, was theoretisch auf einen potenziellen Abwärtstrend hindeuten könnte jedoch glaube ich das nicht aus folgenden Gründen: \n\n**Insider-Handelsaktivitäten:**\n\nhttps://preview.redd.it/zsfjdnnr8lge1.png?width=1231&format=png&auto=webp&s=9932f646884812616dc42da049807061bf2285f2\n\nAktuelle Insiderhandelsdaten für AVDL - \"Menschen verkaufen aus allen möglichen Gründen, kaufen aber nur aus einem!\" (Palczuk Linda sogar 2 mal in den letzten 2 Monaten nimmt Rolle als COO ein laut Website, guten Pharma-Hintergrund)\n\n Bild Screenshot [openinsider.com](http://openinsider.com) \n\n**Analystenbewertungen und Kursziele:**\n\nIm Konsens ein „Strong Buy“-Rating und ein durchschnittliches Kursziel von 20,00 $ (Target price richtet sich ja auf in einem Jahr) d.h. , was auf einen potenziellen Aufwärtstrend von etwa 153 % gegenüber dem aktuellen Kurs hindeutet. \n\n**Finanzieller Überblick:**\n\nMarktkapitalisierung: Ungefähr 761 Millionen $\n\nUmsatz (TTM): $138,16 Millionen\n\nNettogewinn (TTM): Ein Nettoverlust von 72,58 Mio. $, was zu einem Verlust pro Aktie von 0,78 $ führt (Analysten Vorhersage Positiv in 2025)\n\nCash-Position: 65,81 Millionen Dollar an Barmitteln und Äquivalenten\n\nVerschuldung: Gesamtverschuldung von 38,25 Mio. $, was zu einer Netto-Cash-Position von 27,55 Mio. $ führt.\n\nRentabilitätskennzahlen: Negative Eigenkapitalrendite (-78,54%) und Vermögensrendite (-22,14%), was auf Schwierigkeiten bei der Erzielung von Gewinnen aus Vermögen und Eigenkapital hinweist. \n\n[marketwatch.com](http://marketwatch.com) [stockanalysis.com](http://stockanalysis.com)  (Edit. habe hier nicht mehr alle aktualisiert)\n\n  \n**IP derzeit:** Spezialisierung auf Schlafmedizin mit Schwerpunkt auf Narkolepsie-Behandlungen\n\n\n\n**Produktportfolio:**\n\nDas Hauptprodukt von Avadel ist LUMRYZ™, eine Formulierung mit verlängerter Wirkstofffreisetzung von Natriumoxybat. Es ist für die Behandlung von Kataplexie und exzessiver Tagesschläfrigkeit (EDS) bei Narkolepsie-Patienten ab 7 Jahren zugelassen. LUMRYZ bietet ein einmaliges nächtliches Dosierungsschema, wodurch die von einigen Konkurrenten geforderte Dosierung mitten in der Nacht entfällt - um fair zu sein, weiß ich nicht, ob es Konkurrenten gibt, die dasselbe tun.\n\nLUMRYZ steht bspw. im Wettbewerb mit Xyrem und Xywav von Jazz Pharmaceuticals, die beide für ähnliche Indikationen zugelassen sind.\n\nDas Hauptunterscheidungsmerkmal von LUMRYZ ist, wie bereits erwähnt, die einmalige nächtliche Verabreichung, die diese Konkurrenten nicht anbieten.\n\n[reuters.com](http://reuters.com)\n\n \n\n**Umsatz- und EPS-Wachstum:**\n\nIm dritten Quartal 2024 meldete Avadel Nettoeinnahmen in Höhe von 50,0 Mio. USD aus dem Verkauf von LUMRYZ, ein deutlicher Anstieg gegenüber 7,0 Mio. USD im dritten Quartal 2023; außerdem verringerte sich der Nettoverlust auf 2,6 Mio. USD (bzw. 0,03 USD pro verwässerter Aktie) gegenüber 36,3 Mio. USD (bzw. 0,41 USD pro verwässerter Aktie) im gleichen Zeitraum des Vorjahres.\n\nFür das vierte Quartal 2024 rechnet das Unternehmen mit einem Nettoumsatz von ca. 50,0 Mio. $ mit LUMRYZ, was einem Anstieg von über 150 % gegenüber dem gleichen Zeitraum im Jahr 2023 entspricht. Für die Zukunft rechnet Avadel mit einem LUMRYZ-Netto-Produktumsatz zwischen 240 und 260 Millionen US-Dollar im Jahr 2025, was einem Wachstum von 50 % gegenüber dem Vorjahr in der Mitte dieser Prognose entspricht.\n\n[nasdaq.com](http://nasdaq.com)\n\n \n\n**Pipeline und geistiges Eigentum:**\n\nAvadel erweitert seine Pipeline mit der Phase-3-Studie REVITALYZ, die auf idiopathische Hypersomnie abzielt, eine Schlafstörung, die durch übermäßige Tagesschläfrigkeit gekennzeichnet ist; eine Initiative, die darauf abzielt, die Anwendbarkeit von LUMRYZ über Narkolepsie hinaus zu erweitern.\n\n[investoren.avadel.de](http://investoren.avadel.de)\n\n \n\nWas das geistige Eigentum anbelangt, so erhielt LUMRYZ am 16. Oktober 2031 die Orphan Drug Exclusivity (d.h. sieben Jahre exklusive Vermarktungsrechte in den USA für ein Medikament, das zur Behandlung einer seltenen Krankheit entwickelt wurde, während derer die FDA nicht das gleiche Medikament eines anderen Herstellers für dieselbe Erkrankung zulassen kann), die eine Marktexklusivität für diese Indikation gewährleistet. Darüber hinaus besitzt das Unternehmen mehrere Patente, die im Orange Book der FDA aufgeführt sind und Schutz für geistiges Eigentum bis Anfang 2042 bieten.\n\n[investoren.avadel.de](http://investoren.avadel.de)\n\n**Fazit und Kurszielerwartung:**\n\nObwohl AVDL einen Rückgang des Aktienkurses erlebt hat und (noch) mit Rentabilitätsproblemen konfrontiert ist, deuten der starke Kaufkonsens der Analysten sowie das “Insiderbuying” und ein signifikantes, durchschnittliches Kursziel auf Optimismus hinsichtlich der Zukunftsaussichten des Unternehmens hin.\n\nZusätzlich ist der derzeitige Handel unter den gleitenden Durchschnitten und die negativen Rentabilitätskennzahlen mahnen zum einen zur Vorsicht - aber für einen Bullen- Affen wie mich nur noch mehr Grund hier ein paar Scheine zu versenken. \n\nDie kommenden Earnings werden wohl entweder einen Abwärtsdruck oder einen Boost um \\~ 20-100% bescheren. \n\nBin gespannt auf eure Kommentare. Frohes Hebeln; bei TR leider nur Aktien aber hey...\n\nEdit: After Hours Kurs bei 8.16 $",
        "date": 1738442602.0
    },
    {
        "title": "Wenn Du so kluk bist dann mach doch",
        "text": "",
        "date": 1738326383.0
    },
    {
        "title": "Verlustpornos gab's schon in den 1970ern",
        "text": "Interview mit Mark Weinstein aus \"Die Magier der Märkte\" von Jack Schwager das Buch ist voller guter Verlustpornos ",
        "date": 1738355457.0
    },
    {
        "title": "Hihi",
        "text": "Yolo",
        "date": 1738335821.0
    },
    {
        "title": "Ich bin der Taschenhalter",
        "text": "Hi, ich hab meine Taschen erfolgreich gehalten. Zumindest wenn ich jetzt verkaufen würde, aber irgendwie sind mir die ans Herz gewachsen. ",
        "date": 1738337364.0
    },
    {
        "title": "Hebeln illegal in DE?",
        "text": "Ich versuche, mit Hebel zu traden, aber sowohl bei Kraken als auch bei Binance bekomme ich die Meldung, dass es in meiner Region gesetzlich verboten ist. Gibt es noch Plattformen, die Hebel-Trading für mich erlauben? Welche Alternativen gibt es, um Hebel-Trading legal auszuführen, vielleicht mit bestimmten Assets oder über spezielle Anbieter? Hat jemand Erfahrungen mit anderen Brokern oder Derivate-Plattformen in der EU oder weltweit, die nicht durch solche Restriktionen eingeschränkt sind?",
        "date": 1738461716.0
    },
    {
        "title": "Nächste Woche Gewinnveröffentlichungen nach implizierter Bewegung",
        "text": "",
        "date": 1738344012.0
    },
    {
        "title": "leverage ist gut!",
        "text": "",
        "date": 1738316640.0
    },
    {
        "title": "Wochenendschnack vom January 31, 2025",
        "text": "Hoch die Hände - Wochenende! \n\nHier könnt ihr die vergangene Börsenwoche genüsslich sezieren, euch gegenseitig auf die Schulter klopfen (oder trösten) und über den nächsten Hebel nachdenken. Was steht auf eurer Watchlist? 🚀\n\n⚠️ Die Regeln gelten hier natürlich wie immer, aber die Hurensohnmods drücken ein Auge zu, wenn ihr mal ein bisschen über den Tellerrand des Subs schaut. \n\n**🎧 Für die Ohren gibt's hier was Feines:[Podcast & Musik](https://distrokid.com/hyperfollow/monchella420/). Damit tradet es sich gleich doppelt so smooth.**",
        "date": 1738357248.0
    },
    {
        "title": "🚀 Bullish Case für Take-Two Interactive (TTWO)  🚀 Earnings Play",
        "text": "**Erwarteter Kursanstieg von 5-15% durch bevorstehende Earnings und GTA6-Ankündigung!**\n\n🌟 **Die perfekte Gelegenheit, jetzt zu investieren und von einem potenziellen Kurszuwachs zu profitieren!** 🌟\n\n**Take-Two Interactive** hat in der Vergangenheit bewiesen, dass es ein Marktführer in der Gaming-Branche ist. Aber jetzt kommt **GTA6**, und der Hype könnte den Kurs von **TTWO** auf ein völlig neues Niveau katapultieren. Bereit für den nächsten großen Sprung? Hier ist, warum du jetzt handeln solltest!\n\n# 🎮 GTA6-Ankündigung: Ein Megafon für den Aktienkurs von TTWO 🎮\n\n**GTA6** ist das am meisten erwartete Spiel aller Zeiten – die **Community weltweit** ist aufgeregt, und das wirkt sich direkt auf den Aktienkurs von **Take-Two** aus.\n\n💥 **Das Datum, das alles verändern könnte:** **17. September 2025** (Das gleiche Datum wie der **Release von GTA5** im Jahr 2013)  \n💥 **Warum jetzt der perfekte Zeitpunkt ist:** Die Ankündigung des **GTA6**\\-Veröffentlichungsdatums und der potenzielle Trailer-Release könnte **den Kurs von TTWO um bis zu 15% in den nächsten Wochen treiben**.\n\n➡️ Erinnern wir uns: **Nach der Ankündigung von GTA5** im Jahr 2011 stieg der Kurs von **Take-Two** innerhalb von nur wenigen **Tagen um 12%** – das entsprach einem **Zuwachs von etwa 2,5 Milliarden USD in der Marktkapitalisierung!**\n\nJetzt, da der Hype um **GTA6** gewaltiger ist, erwarten wir einen ähnlichen, wenn nicht sogar stärkeren **Kursanstieg!** Ein einzigartiger Moment, um jetzt **Optionskäufe** zu tätigen und vom **kommenden Kursboom** zu profitieren!\n\n# 💡 Die Fakten:\n\n1. **GTA6 – Das Spiel der Spiele:**\n2. **GTA6** wird weltweit mit Spannung erwartet und könnte den Kurs von **Take-Two** bis zum **Verfall der Optionen** erheblich anheizen.Die **Community** in sozialen Medien wie **Reddit**, **Twitter** und **TikTok** spricht täglich über **GTA6**, was den Hype und die mediale Aufmerksamkeit verstärkt.**GTA5** brachte **Take-Two** 2013 zu einer **Marktkapitalisierung von über 2 Milliarden USD**. Mit **GTA6** werden die Erwartungen noch größer sein – und das kann den Kurs von **TTWO** explodieren lassen!\n3. **GTA6-Leak und das 17. September Release:**\n4. **Xuruguay** – ein Instagram-Account, der **eng mit Sony zusammenarbeitet**, postete kürzlich das angebliche Veröffentlichungsdatum von **GTA6 (17. September 2025)**, das sofort von der Community aufgegriffen und verbreitet wurde. Dieses Datum entspricht genau dem Veröffentlichungsdatum von **GTA5** im Jahr 2013. Das Datum und der Leak wurden sofort von der **Community auf Twitter, Reddit** und in anderen sozialen Medien aufgegriffen und spekuliert, was zu einer verstärkten Aufmerksamkeit rund um das Unternehmen geführt hat.**Interessanterweise wurde die Story \"debunked\"**. Laut dem Artikel auf [**beebom.com**](http://beebom.com) ([Link zur Quelle](https://beebom.com/gta-6-release-date-leaked-by-store-listing-debunked/)) wurde der Leak als falsch bezeichnet. Doch, und das ist entscheidend, **Xuruguay arbeitet sehr eng mit Sony zusammen** und die Entschuldigung könnte tatsächlich nur eine **\"Fake Apology\"** sein, um das Datum zu verschleiern – ein weiteres Zeichen dafür, wie heiß das Thema ist!Es gibt jedoch keine bestätigten Hinweise darauf, dass **Xuruguay** in enger Verbindung mit **Sony** oder **Take-Two Interactive** steht. Solche Angaben von Einzelhändlern sind oft spekulativ und sollten mit Vorsicht betrachtet werden. Aber wozu sollte **Xuruguay** das posten? Sie haben dadurch weder mehr **Sales** generiert noch irgendeine andere Art von Profit gehabt. **Entweder war es nur ein Publicity Stunt oder ein ehrlicher Fehler.**\n5. **Memes und Witze über GTA6:**\n6. Wer kennt es nicht? Egal was in der Welt passiert, der erste Kommentar darunter lautet meist: **„Selbst das ist passiert, bevor GTA6 raus kam“**. Die **Community auf Reddit, Twitter und anderen Plattformen** macht regelmäßig Witze und Memes, die das verzögerte Erscheinen von **GTA6** ins Lächerliche ziehen. Diese humorvolle Art, die Langeweile während des Wartens zu überbrücken, hat jedoch auch eine ernsthafte Wirkung: Sie hält das Spiel und die damit verbundene Spekulation ständig im Gespräch. Selbst als politische oder wirtschaftliche Nachrichten die Runde machen, ist es nicht ungewöhnlich, dass Leute kommentieren: „Selbst diese Krise war schon da, bevor GTA6 rauskam.“\n\n# 🛑 Unstimmigkeit:\n\nEs gibt eine interessante **Unstimmigkeit** in der Theorie, dass der **17. September 2025** der **Release-Tag für GTA6** sein wird. Normalerweise erscheint **Grand Theft Auto** immer an einem **Dienstag** oder **Freitag**.\n\n* **GTA5** – veröffentlicht am **17. September 2013**, einem **Dienstag**.\n* **GTA4** – veröffentlicht am **29. April 2008**, einem **Dienstag**.\n* **GTA: San Andreas** – veröffentlicht am **26. Oktober 2004**, einem **Dienstag**.\n\nDer **17. September 2025** fällt jedoch auf einen **Mittwoch**. Dies wäre das erste Mal, dass ein **GTA-Titel** an einem **Mittwoch** veröffentlicht wird, was gegen die gängige Praxis verstößt. Obwohl es nicht unmöglich ist, könnte dies ein Hinweis darauf sein, dass das Datum von **Xuruguay** nicht zutreffend ist, und dass **GTA6** tatsächlich einen anderen Tag im September oder Oktober 2025 als Release-Tag erhalten könnte.\n\n# 📈 Fundamentaldaten von Take-Two Interactive:\n\n**Take-Two Interactive (TTWO)** ist mehr als nur ein Gaming-Unternehmen. Es ist ein **globaler Marktführer** mit einer beeindruckenden Bilanz:\n\n* **Aktueller Kurs:** **188.81,23 USD**\n* **Marktkapitalisierung:** **Über 20 Milliarden USD**\n* **Kurs-Gewinn-Verhältnis (KGV):** Historisch bei etwa **40,82** (ein Zeichen für das starke Wachstumspotenzial des Unternehmens)\n* **Wachstumsstrategie:** Erfolgreiche Titel wie **GTA V**, **Red Dead Redemption 2**, und **NBA 2K** zeigen die solide Basis für weiteres Wachstum.\n* **Umsatzwachstum:** Das Unternehmen erzielt konstant gute Einnahmen durch erfolgreiche Titel wie **GTA V**, **Red Dead Redemption 2**, und **NBA 2K**.\n* **Zukunftsausblick:** Take-Two hat das Potenzial, durch **GTA6** und andere künftige Veröffentlichungen seinen Umsatz weiter zu steigern.\n\n# 📅 Letzte Earnings Calls und Kursreaktionen:\n\nHier ein Blick auf die letzten **6 Earnings Calls** und die beeindruckenden Kursbewegungen von **TTWO**:\n\n1. **Q3 2025 (Veröffentlicht am 6. Februar 2025):**\n2. **Erwartungen:** Analysten prognostizieren einen Anstieg des Nettoumsatzes auf etwa **5,5 bis 5,7 Milliarden USD**, was eine Steigerung im Vergleich zum Vorjahr darstellt.**Ausblick:** Angesichts der positiven Marktstimmung und der bevorstehenden Veröffentlichung von **GTA6** könnte **Take-Two Interactive** die Erwartungen übertreffen und somit den Aktienkurs weiter ankurbeln.**Aktueller Kurs:** **191,23 USD** (Kurs könnte bis zum Earnings Call steigen)\n3. **Q2 2025 (Veröffentlicht am 6. November 2024):**\n4. **Nettoumsatz:** **5,570 bis 5,670 Millionen USDKosten des Umsatzes:** **2,397 bis 2,422 Millionen USDBruttogewinn:** **3,173 bis 3,248 Millionen USDKursbewegung:** Der Kurs stieg um **+5%**, von **184 USD auf 193 USD** aufgrund der positiven Ergebnisse.\n5. **Q1 2025 (Veröffentlicht am 8. August 2024):**\n6. **Nettoumsatz:** **1,338,2 Millionen USDKosten des Umsatzes:** **567,1 Millionen USDBruttogewinn:** **771,1 Millionen USDKursbewegung:** Der Kurs fiel um **-3%**, von **179 USD auf 173 USD**, aufgrund der leichten Enttäuschung in den Margen und des vorsichtigen Ausblicks auf die kommenden Quartale.\n7. **Q4 2024 (Veröffentlicht am 16. Mai 2024):**\n8. **Nettoumsatz:** **4,000 Millionen USDKosten des Umsatzes:** **1,500 Millionen USDBruttogewinn:** **2,500 Millionen USDKursbewegung:** Der Kurs stieg um **+6%**, von **176 USD auf 186 USD**, aufgrund starker Ergebnisse und positiver Prognosen für das nächste Quartal.\n9. **Q3 2024 (Veröffentlicht am 8. Februar 2024):**\n10. **Nettoumsatz:** **3,500 Millionen USDKosten des Umsatzes:** **1,200 Millionen USDBruttogewinn:** **2,300 Millionen USDKursbewegung:** Der Kurs stieg um **+5%**, von **184 USD auf 193 USD**, aufgrund positiver Ergebnisse und eines starken Ausblicks.\n11. **Q2 2024 (Veröffentlicht am 6. November 2023):**\n12. **Nettoumsatz:** **2,800 Millionen USDKosten des Umsatzes:** **1,000 Millionen USDBruttogewinn:** **1,800 Millionen USDKursbewegung:** Der Kurs stieg um **+8%**, von **172 USD auf 186 USD**, nach der Bekanntgabe starker Verkaufszahlen und einer positiven Prognose für die zukünftigen Titel.\n\n# 💥 Optionen für maximalen Gewinn:\n\nJetzt kommt der aufregende Teil: **Die richtigen Optionen für massive Gewinne!**\n\n1. **Beste Option für höchsten Gewinn & Sicherheit** → **195C Call (5,55 USD, 14. Februar)**\n2. **ROI von 109,7%** bei einem Kurs von **205,64 USDBreak-even bei 200,55 USD**, also nicht allzu riskant.\n3. **Beste Option für günstigen Einstieg & hohe Rendite** → **200C Call (3,95 USD, 14. Februar)**\n4. **ROI von 68,1%** bei einem Kurs von **205,64 USDBreak-even bei 203,95 USD**, also etwas riskanter.\n5. **Langfristige Option mit mehr Spielraum** → **195C Call (5,90 USD, 21. Februar)**\n6. **ROI von 105,8%**, falls der Kurs weiter steigt**Mehr Zeitwert**, falls der Kurs sich erst nach den Earnings bewegt\n\n🔥 **Empfehlung:**\n\n* Wenn du **schnellen Gewinn** willst → **195C (5,55 USD, 14. Februar)**\n* Wenn du **niedrigere Kosten & hohen ROI** willst → **200C (3,95 USD, 14. Februar)**\n* Wenn du **mehr Zeit & Sicherheit** willst → **195C (5,90 USD, 21. Februar)**\n\n# 🚀 Fazit – Jetzt investieren:\n\n**TTWO** steht an einem Wendepunkt. Mit der bevorstehenden **GTA6-Ankündigung** und den soliden Fundamentaldaten könnte der Kurs um **5-15% steigen**. **Unabhängig davon, ob TTWO das genaue Datum bekannt gibt**, sind die finanziellen Aussichten außergewöhnlich. **In fast jedem Earnings Call steigt der Kurs um 4-8%.** Mit der **GTA6**\\-Ankündigung könnte der Kurs auch bei sehr guten Zahlen auf **20% oder mehr** hochschießen. Jetzt ist der ideale Zeitpunkt, **205C Call-Optionen** zu kaufen und von diesem explosiven Kursanstieg zu profitieren. Die **GTA6-Hype-Welle** könnte den Kurs in den kommenden Wochen kräftig anheizen – und du könntest von diesem potenziellen Anstieg massiv profitieren!\n\n**Bereite dich jetzt vor – die Gelegenheit kommt schnell. Investiere in TTWO-Optionen und profitiere von der GTA6-Magie!**",
        "date": 1738340432.0
    },
    {
        "title": "Sry but not sry",
        "text": "",
        "date": 1738249471.0
    },
    {
        "title": "Gestern hat mich gebrochen es wird Zeit für den großen Hebel",
        "text": "Ich bin heute sehr früh erwacht und hab gehört wie sich Peter Zwegats Flipchart im Himmel für mich aufklappt, es wird Zeit für männliches Fremdkapital ",
        "date": 1738226502.0
    },
    {
        "title": "Tägliche Diskussion - January 31, 2025",
        "text": "Hallo Retards!👋\n\nWillkommen zum täglichen Diskussionsfaden! Hier könnt ihr alles Aktuelle vom Kapitalmarkt zerlegen, analysieren und heiß diskutieren. 💰💬 Aber das ist noch nicht alles: Im Laufe des Tages könnt ihr hier auch schon eure brillanten Ideen für morgen teilen.\n\n🎙️ **Kleiner Reminder:** Unser legendärer MSW-Podcast droppt jeden Donnerstag auf [Spotify](https://open.spotify.com/show/4F53gWxLNexCYxnEAkcfZe) und Co.   \n🎧 Mehr Podcasts und epische Beats von MSWlern für MSWler gibt's [hier](https://distrokid.com/hyperfollow/monchella420/).\n\n🛒 *Shoppen macht glücklich!* Checkt unseren [Shop](https://mauerstrassenwetten.myspreadshop.de) aus – für den stylishen Kapitalmarkt-Überblick.  \n📚 Ihr seid wissenshungrig? Schaut mal ins [MSWiki](#), euer Lexikon rund um Regeln, Tipps und Tricks.\n\nHabt einen profitablen Tag! 🚀💸",
        "date": 1738292475.0
    },
    {
        "title": "Irgendwas mit Äpfeln",
        "text": "Diversifizieren ist für risikoscheue Lutscher.",
        "date": 1738239136.0
    }
]